[
  {
    "id": "001",
    "exam": "AZ900",
    "type": "options",
    "domain":"Descrever os conceitos da nuvem",
    "header": "Qual é a vantagem da computação em nuvem em comparação com implantações locais?",
    "options": [
      "Você pode dimensionar mais rapidamente",
      "Você pode trabalhar em várias estações de trabalho",
      "Você tem acesso total em caso de interrupção da internet",
      "Você tem suas CPUs"
    ],
    "correct": [
      "Você pode dimensionar mais rapidamente"
    ]
  },
  {
    "id": "002",
    "exam": "AZ900",
    "type": "multiple",
    "domain":"Descrever a arquitetura e os serviços do Azure",
    "header": "Quais dois recursos do Azure podem usar as zonas de disponibilidade? Cada resposta correta apresenta uma solução completa.",
    "options": [
      "Bancos de Dados SQL do Azure",
      "Máquinas Virtuais do Azure",
      "Assinatures do Azure",
      "Grupos de Recursos do Azure"
    ],
    "correct": [
      "Máquinas Virtuais do Azure",
      "Bancos de Dados SQL do Azure"
    ]
  },
  {
    "id": "003",
    "exam": "AZ900",
    "type": "truefalse",
    "domain": "Descrever os conceitos da nuvem",
    "header": "Para cada uma das afirmações a seguir, selecione Sim se a afirmação for verdadeira. Caso contrário, selecione Não.",
    "body": "NOTA: Cada seleção correta vale um ponto.",
    "options": [
      "Uma solução de plataforma como serviço (PaaS) que hospeda aplicativos web no Azure fornece controle total dos sistemas operacionais que hospedam aplicativos",
      "Uma solução de plataforma como serviço (PaaS) que hospeda aplicativos Web no Azure oferece a capacidade de dimensionar a plataforma automaticamente",
      "Uma solução de plataforma como serviço (PaaS) que hospeda aplicativos Web no Azure fornece soluções profissionais serviços de desenvolvimento para adicionar continuamente recursos a aplicativos personalizados"
    ],
    "correct": [
      "false",
      "true",
      "true"
    ]
  },
  {
    "id": "004",
    "exam": "AZ900",
    "type": "select",
    "domain": "Descrever os conceitos da nuvem",
    "header": "Selecione a resposta que conclui corretamente a frase.",
    "body": "Quando você está implementando uma solução de Software como Serviço (SaaS), você é responsável por _______________",
    "options": [
      "Configurar a alta disponibilidade.",
      "Definir regras de escalabilidade.",
      "Instalar a solução SaaS.",
      "Configurar a solução SaaS."
    ],
    "correct": [
      "Configurar a solução SaaS."
    ]
  },
  {
      "id": "005",
      "exam": "AZ900",
      "domain": "Descrever os conceitos da nuvem",
      "type": "dragdrop",
      "header": "Qual solução de implantação em nuvem é usada para máquinas virtuais do Azure e bancos de dados SQL do Azure? Para responder, arraste e solte as opções apropriadas na área de resposta.",
      "body": "NOTA: Cada correspondência correta vale um ponto.",
      "options": [
          "Máquinas Virtuais do Azure",
          "Bancos de Dados SQL do Azure"
      ],
      "correct": [
          "Infraestrutura como Serviço (IaaS)",
          "Plataforma como Serviço (PaaS)"
      ]
  }
]