[
  {
    "id": "001",
    "exam": "AZ204",
    "domain": "Implementar a segurança do Azure",
    "type": "options",
    "header": "Você gerencia um aplicativo Web do Serviço de Aplicativo do Azure chamado app1. O App1 está registrado como um aplicativo do Microsoft Entra ID. É necessário garantir que as informações do usuário conectado no Microsoft Entra ID possam ser recuperadas pelo app1 ao utilizar o Microsoft Graph.",
    "body": "O que você deve configurar?",
    "options": [
      "appRoles",
      "Permissões do aplicativo",
      "Permissões delegadas",
      "GroupMembershipClaims"
    ],
    "correct": [
      "Permissões delegadas"
    ]
  },
  {
    "id": "002",
    "exam": "AZ204",
    "domain": "Implementar a segurança do Azure",
    "type": "options",
    "header": "Você gerencia um aplicativo Web do Serviço de Aplicativo do Azure chamado app1. O App1 é registrado como um aplicativo multilocatário em um locatário do Microsoft Entra ID denominado tenant1.",
    "body": "Você precisa conceder ao app1 a permissão para acessar a API do Microsoft Graph no tenant1. Qual entidade de serviço você deve usar?",
    "options": [
      "Herdada",
      "Identidade gerenciada atribuída pelo sistema",
      "Aplicativo",
      "Identidade gerenciada atribuída pelo usuário"
    ],
    "correct": [
      "Aplicativo"
    ]
  },
  {
    "id": "003",
    "exam": "AZ204",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "type": "multiple",
    "header": "Você desenvolve o código a seguir para ler todos os eventos publicados para a primeira partição nos Hubs de Eventos do Azure.",
    "code": "question-003.md",
    "body": "Você precisa concluir o código. Quais são as duas ações que você deve executar? Cada resposta correta apresenta uma parte da solução.",
    "options": [
      "Insira o seguinte segmento de código na linha 6: EventPosition startingPosition = EventPosition.Earliest;",
      "Insira o seguinte segmento de código na linha 7: string partitionId = (await consumer.GetPartitionIdsAsync()).First();",
      "Insira o seguinte segmento de código na linha 6: EventPosition startingPosition = EventPosition.Latest;",
      "Insira o seguinte segmento de código na linha 7: string partitionId = (await consumer.GetPartitionIdsAsync()).Last();"
    ],
    "correct": [
      "Insira o seguinte segmento de código na linha 6: EventPosition startingPosition = EventPosition.Earliest;",
      "Insira o seguinte segmento de código na linha 7: string partitionId = (await consumer.GetPartitionIdsAsync()).First();"
    ]
  },
  {
    "id": "004",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está configurando um aplicativo Web que fornece streaming de vídeo aos usuários. O aplicativo faz uso de CI/CD. Você precisa garantir que o aplicativo esteja altamente disponível e que a experiência de streaming dos usuários seja constante. Você também deseja configurar o aplicativo para armazenar dados em uma localização geográfica mais próxima do usuário.",
    "options": [
      "Você inclui o uso de uma CDN (rede de distribuição de conteúdo) do Azure em seu design.",
      "Você inclui o uso do Cache Redis do Azure em seu design.",
      "Você inclui o uso de uma rede de área de armazenamento (SAN) em seu projeto."
    ],
    "correct": [
      "true",
      "false",
      "false"
    ],
    "body": "Marque 'verdadeiro' se as soluções apresentadas atendem o objetivo, caso contrário, marque 'falso'"
  },
  {
    "id": "005",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você desenvolve um aplicativo Web em um plano de serviço de aplicativo de nível D1. Você percebe que o tempo de carregamento da página aumenta durante períodos de pico de tráfego.",
    "options": [
      "Habilitar o escalonamento automático no aplicativo Web.",
      "Mudar para o plano de nível Premium App Service.",
      "Mudar para o plano de nível Standard App Service.",
      "Mudar para o plano de consumo dos Serviços de Aplicativos do Azure."
    ],
    "correct": [
      "Mudar para o plano de nível Standard App Service."
    ],
    "body": "Você deseja implementar o escalonamento automático quando a carga da CPU estiver acima de 80%. Sua solução deve minimizar custos. O que você deve fazer primeiro?"
  },
  {
    "id": "006",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você é um desenvolvedor em sua empresa e precisa atualizar as definições de um aplicativo lógico existente.",
    "options": [
      "O Pacote de Integração Empresarial (EIP)",
      "A Visualização do código do Aplicativo Lógico",
      "As Conexões de API",
      "O Designer de Aplicativos Lógicos"
    ],
    "correct": [
      "A Visualização do código do Aplicativo Lógico"
    ],
    "body": "O que você deve usar?"
  },
  {
    "id": "007",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo uma solução para uma API pública. O back-end da API está hospedado em uma instância do Serviço de Aplicativo do Azure. Você implementou um serviço RESTful para o back-end da API e deve configurar a autenticação de back-end para a instância de serviço do API Management.",
    "options": [
      "Configurar credenciais básicas de gateway para o recurso Azure.",
      "Configurar credenciais de gateway de certificado de cliente para o endpoint HTTP(s).",
      "Configurar credenciais de gateway básicas para o endpoint HTTP(s).",
      "Configurar credenciais de gateway de certificado de cliente para o recurso do Azure."
    ],
    "correct": [
      "false",
      "true",
      "true",
      "false"
    ],
    "body": "Marque 'verdadeiro' se as soluções apresentadas atendem o objetivo, caso contrário, marque 'falso'"
  },
  {
    "id": "008",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você cria a política de retenção a seguir.",
    "options": [
      "\"tierToCool\": { \"daysAfterModificationGreaterThan\": 90 }",
      "\"tierToCool\": { \"daysAfterCreationGreaterThan\": 90 }",
      "\"tierToArchive\": { \"daysAfterModificationGreaterThan\": 90 }",
      "\"tierToArchive\": { \"daysAfterCreationGreaterThan\": 90 }"
    ],
    "correct": [
      "\"tierToCool\": { \"daysAfterModificationGreaterThan\": 90 }"
    ],
    "body": "Você precisará fazer a transição de blobs na camada de acesso frequente para uma camada online se os blobs não tiverem sido modificados em mais de 90 dias. Qual segmento de código você deve adicionar à linha 14?",
    "code": "question-008.md"
  },
  {
    "id": "009",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você está criando uma conta do Azure Cosmos DB que faz uso da API para NoSQL. Novos dados serão adicionados à conta todos os dias por uma aplicação web. Você precisa garantir que uma notificação por email seja enviada quando a informação é recebida de dispositivos IoT, e o custo da solução seja o menor possível.",
    "options": [
      "Usar um conector do Azure Cosmos DB",
      "Usar uma associação do SendGrid",
      "Usar uma ação do SendGrid",
      "Usar o Plano de Consumo"
    ],
    "correct": [
      "Usar uma associação do SendGrid",
      "Usar o Plano de Consumo"
    ],
    "body": "Você decide usar o Azure Functions. Quais configurações a seguir você precisa fazer na sua função?"
  },
  {
    "id": "010",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Essa questão pede que você avalie a sentença entre conchetes e determine se está correta. Caso não esteja, selecione a alternativa que corrige a sentença.",
    "options": [
      "Nenhuma mudança é necessária",
      "Mongorestore",
      "Azure Storage Explorer",
      "AzCopy"
    ],
    "correct": [
      "Mongorestore"
    ],
    "body": "Sua empresa tem uma implantação local do MongoDB e uma conta do Azure Cosmos DB que faz uso da API do MongoDB. Você precisa elaborar uma estratégia para migrar o MongoDB para a conta do Azure Cosmos DB. Você inclui a ferramenta [Data Management Gateway] em sua estratégia de migração."
  },
  {
    "id": "011",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "A sua empresa tem um cluster Azure Kubernetes Service (AKS) que você gerencia a partir de um dispositivo ingressado no Azure AD. Os desenvolvedores criaram um aplicativo chamado MyApp. MyApp foi empacotado em uma imagem de contêiner. Você precisa implantar o arquivo de Manifest YAML para o aplicativo.",
    "options": [
      "Você instala o Azure CLI no dispositivo e executa o comando 'kubectl apply f myapp.yaml'",
      "Você instala um docker client no dispositivo e executa o comando 'docker run -it microsoft/azure-cli:0.10.17'"
    ],
    "correct": [
      "true",
      "false"
    ],
    "body": "Marque 'verdadeiro' se as soluções apresentadas atendem o objetivo, caso contrário, marque 'falso'"
  },
  {
    "id": "012",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você desenvolve uma função do Azure que se conecta a um banco de dados SQL e é instrumentada usando o Application Insights. Você precisa exibir o texto completo da consulta SQL ao inspecionar a guia Dependência no Application Insights.",
    "options": [
      "\"enableDependencyTracking\": true",
      "\"enablePerformanceCountersCollection\": true",
      "\"dependencyTrackingOptions\": { \"enableSqlCommandTextInstrumentation\": true },",
      "\"logLevel\": { \"default\": \"Verbose\" }"
    ],
    "correct": [
      "\"enableDependencyTracking\": true",
      "\"dependencyTrackingOptions\": { \"enableSqlCommandTextInstrumentation\": true },"
    ],
    "body": "Quais são as duas configurações no arquivo host.json que você deve usar? Cada resposta correta apresenta uma parte da solução."
  },
  {
    "id": "013",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você tem uma instância do Application Insights chamada insight1 e precisa configurar um aplicativo Web para enviar dados de telemetria para o insight1.",
    "options": [
      "Alertas",
      "Mapa do aplicativo",
      "Chave de instrumentação",
      "Análise de uso"
    ],
    "correct": [
      "Chave de instrumentação"
    ],
    "body": "Qual parâmetro do Application Insights você deve usar?"
  },
  {
    "id": "014",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você gerencia um banco de dados do Azure Cosmos DB chamado database1 e precisa ler itens do banco de dados sem nenhuma garantia de ordenação e garantir a maior disponibilidade.",
    "options": [
      "Forte",
      "Desatualização limitada",
      "Sessão",
      "Eventual"
    ],
    "correct": [
      "Eventual"
    ],
    "body": "Qual nível de consistência você deve usar?"
  },
  {
    "id": "015",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você gerencia um contêiner do Azure Cosmos DB chamado container1 e precisa usar o método ReadItemAsync para ler um item do serviço do Azure Cosmos.",
    "options": [
      "consistency level",
      "eTag",
      "partitionKey",
      "sessionToken",
      "itemId"
    ],
    "correct": [
      "partitionKey",
      "itemId"
    ],
    "body": "Quais dois parâmetros você precisa fornecer? Cada resposta correta apresenta uma parte da solução."
  },
  {
    "id": "016",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você tem uma política de ciclo de vida de Armazenamento do Microsoft Azure para blobs de blocos. Você precisa criar uma regra de filtro prefixoMatch que conterá uma matriz de cadeias de caracteres para que os prefixos sejam correspondidos.",
    "options": [
      "Uma marca de índice de blob de blocos",
      "Um nome de blob de blocos",
      "Um nome de contêiner",
      "Um nome da conta de armazenamento"
    ],
    "correct": [
      "Um nome de contêiner"
    ],
    "body": "Qual deve ser o primeiro elemento da cadeia de caracteres de prefixo?"
  },
  {
    "id": "017",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Uma empresa implementa uma conta do Azure Cosmos DB de várias regiões. Você precisa configurar o nível de consistência padrão para a conta. O nível de consistência deve garantir que as operações de atualização feitas como um lote dentro de uma transação estejam sempre visíveis juntas.",
    "options": [
      "Prefixo consistente",
      "Desatualização limitada",
      "Sessão",
      "Eventual"
    ],
    "correct": [
      "Prefixo consistente"
    ],
    "body": "Qual nível de consistência você deve usar?"
  },
  {
    "id": "018",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está planejando hospedar um site estático em uma conta de Armazenamento do Microsoft Azure. O site deve estar acessível somente por meio de HTTPS usando um nome de domínio personalizado. Você habilita o recurso de hospedagem de site estático. Defina a página padrão como index.html e a página de erro como error.html.",
    "options": [
      "Defina o nível de acesso do contêiner de hospedagem da Web como público",
      "Adicione o domínio personalizado em rede na conta de Armazenamento do Azure",
      "Integre o site estático à CDN do Azure",
      "Cria um contêiner chamado $web",
      "Carregue os arquivos index.html e error.html no contêiner de hospedagem da Web"
    ],
    "correct": [
      "Integre o site estático à CDN do Azure",
      "Carregue os arquivos index.html e error.html no contêiner de hospedagem da Web"
    ],
    "body": "Quais duas ações você deve executar em seguida? Cada resposta correta apresenta uma parte da solução."
  },
  {
    "id": "019",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você está desenvolvendo uma aplicativo do Azure Functions usando o Visual Studio. O aplicativo processará pedidos inseridos por um aplicativo Web do Azure. O aplicativo Web coloca as informações do pedido no Armazenamento de Fila do Azure.",
    "options": [
      "O código irá mostrar logs do horário em que o pedido foi processado da fila",
      "Quando a função ProcessOrders falha, a função irá tentar novamente até 5 vezes para um mesmo pedido, incluindo a primeira tentativa",
      "Quando tem multiplos pedidos na fila, um lote de pedidos será recuperado da fila e a função ProcessOrders irá executar multiplas instâncias concorrentes para processar os pedidos",
      "A função ProcessOrders envia os pedidos para uma tabela Orders no Armazenamento de Tabelas do Azure"
    ],
    "correct": [
      "false",
      "true",
      "true",
      "true"
    ],
    "body": "Você precisa revisar o código do aplicativo do Azure Function acima. Cada seleção correta vale um ponto",
    "code": "question-019.md"
  },
  {
    "id": "020",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está desenvolvendo uma solução para um hospital e provisiona um banco de dados CosmosDB com a API NoSql e define o nível de consistência padrão da conta como Forte. A solução possui os seguinte casos de uso:",
    "requirements": [
      "O status mais recente dos detalhes de um paciente deve ser recuperado mesmo quando múltiplos usuários em diferentes locais atualizaram o registro do paciente.",
      "Os dados de monitoramento de saúde de um paciente recuperados devem ser a versão mais recente ou uma antes dela.",
      "Depois que um paciente recebe alta e todas as cobranças foram avaliadas, o registro de faturamento do paciente contém as cobranças finais."
    ],
    "options": [
      "Retorna o status mais recente do paciente",
      "Returna os dados de monitoramento de saúde no máximo uma versão anterior",
      "Depois que um paciente recebe alta e todas as cobranças foram avaliadas, o registro de faturamento do paciente contém as cobranças finais"
    ],
    "correct": [
      "Forte",
      "Desatualização limitada",
      "Eventual"
    ],
    "body": "Você precisa minimizar a latência e qualquer impacto na disponibilidade da solução. Você deve substituir o nível de consistência padrão no nível de consulta para atender às garantias de consistência necessárias para os cenários. Quais níveis de consistência você deve implementar?"
  },
  {
    "id": "021",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está configurando um ambiente de desenvolvimento para sua equipe. Você implanta a imagem mais recente do Visual Studio do Azure Marketplace em sua assinatura do Azure. O ambiente de desenvolvimento requer vários kits de desenvolvimento de software (SDKs) e componentes de terceiros para dar suporte ao desenvolvimento de aplicativos em toda a organização. Você instala e personaliza a máquina virtual (VM) implantada para sua equipe de desenvolvimento.",
    "options": [
      "Armazenamento de blobs do Azure",
      "Armazenamento Data Lake do Azure",
      "Amazenamento de arquivos do Azure",
      "Armazenamento de tabelas do Azure"
    ],
    "correct": [
      "Armazenamento de blobs do Azure"
    ],
    "body": "A VM personalizada deve ser salva para permitir o provisionamento de um novo ambiente de desenvolvimento de membro da equipe. Qual serviço você deve usar para armazenar as imagens da VM para provisionamento futuro."
  },
  {
    "id": "022",
    "exam": "AZ204",
    "type": "select",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo que precisa de acesso a uma VM (máquina virtual) do Azure. O ciclo de vida de acesso do aplicativo deve estar associado à instância de serviço da VM. Você precisa habilitar a identidade gerenciada para a VM. Como você deve concluir o segmento do PowerShell? Para responder, selecione as opções apropriadas na área de resposta.",
    "options": [
      "-AssignIdentity $SystemAssigned",
      "-AssignIdentity $UserAssigned",
      "-IdentityType $SystemAssigned",
      "-IdentityType $UserAssigned"
    ],
    "correct": [
      "-IdentityType $SystemAssigned"
    ],
    "body": "Update-AzVM -ResourceGroupName \"ContosoRG\" -VM $vm _____________________."
  },
  {
    "id": "023",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Uma empresa usa Instâncias de Contêiner do Azure para um aplicativo e você precisa garantir que os contêineres sejam reiniciados quando o processo terminar com um código de saída diferente de zero. O que você deve fazer?",
    "options": [
      "Definir uma política de reinicialização de contêiner de `Always`",
      "Executar os contêineres usando uma identidade gerenciada",
      "Definir uma política de reinicialização de contêiner de `Never`",
      "Executar um contêiner de inicialização"
    ],
    "correct": [
      "Definir uma política de reinicialização de contêiner de `Always`"
    ]
  },
  {
    "id": "024",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você planeja desenvolver um aplicativo Web do Serviço de Aplicativo do Azure chamado app1 usando um contêiner personalizado do Windows.",
    "options": [
      "WEBSITE_LOAD_CERTIFICATES",
      "WEBSITE_ROOT_CERT_PATH",
      "WEBSITE_CORS_ALLOWED_ORIGINS",
      "WEBSITE_AUTH_TOKEN_CONTAINER_SASURL"
    ],
    "correct": [
      "WEBSITE_LOAD_CERTIFICATES"
    ],
    "body": "Você precisa carregar um certificado TLS/SSL no código do aplicativo. Qual configuração de aplicativo você deve configurar?"
  },
  {
    "id": "025",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você cria um aplicativo Web do Azure localment, que consiste em um pacote ZIP. Você precisa implantar o aplicativo usando a CLI do Azure.",
    "options": [
      "Execute 'az webapp deploy' especificando '--clean true'",
      "Execute 'az webapp deploy' especificando '--restart true'",
      "Execute 'az webapp deploy' em um slot de preparo com a troca automática habilitada",
      "Execute 'az webapp deploy' usando um valor alto para o parâmetro '--timeout'"
    ],
    "correct": [
      "Execute 'az webapp deploy' em um slot de preparo com a troca automática habilitada"
    ],
    "body": "A implantação deve reduzir a probabilidade de arquivos bloqueados. O que você deve fazer?"
  },
  {
    "id": "026",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você gerencia os slots de implantação de preparo e produção de um aplicativo Web do Serviço de Aplicativo do Azure chamado app1.",
    "options": [
      "Centro de implantação",
      "Configuração do slot de implantação",
      "Identidade gerenciada",
      "Escalar verticalmente"
    ],
    "correct": [
      "Configuração do slot de implantação"
    ],
    "body": "Você precisa garantir que uma cadeia de conexão não seja trocada quando a troca for executada. Qual configuração você deve usar?"
  },
  {
    "id": "027",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você gerencia uma implantação de várias instâncias de um aplicativo Web do Serviço de Aplicativo do Azure chamado app1. Você precisa garantir que um aplicativo cliente seja roteado para a mesma instância durante a vida útil da sessão.",
    "options": [
      "WebSocket",
      "Sempre",
      "Versão HTTP",
      "Afinidade ARR"
    ],
    "correct": [
      "Afinidade ARR"
    ],
    "body": "Qual configuração de plataforma você deve usar?"
  },
  {
    "id": "028",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você planeja criar um aplicativo do Azure Functions baseado em script em C#.",
    "options": [
      "Criar um arquivo function.json para cada função.",
      "Criar um arquivo host.json para o aplicativo do Azure Functions.",
      "Decorar métodos de cada função com atributos C#.",
      "Decorar parâmetros de cada função com atributos C#."
    ],
    "correct": [
      "Criar um arquivo function.json para cada função."
    ],
    "body": "Você precisa configurar o gatilho e as associações para as funções do aplicativo do Azure Functions. O que você deve fazer?"
  },
  {
    "id": "029",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Um grupo de contêineres nas Instâncias de Contêiner do Azure tem vários contêineres, que devem ser reiniciados quando o processo executado no grupo for encerrado por um erro.",
    "options": [
      "az container restart --name mycontainer --resource-group myResourceGroup --no-wait",
      "az container create --resource-group myResourceGroup --name mycontainer --image mycontainerimage --restart-policy Always",
      "az container create --resource-group myResourceGroup --name mycontainer --image mycontainerimage --restart-policy Never",
      "az container create --resource-group myResourceGroup --name mycontainer --image mycontainerimage --restart-policy OnFailure"
    ],
    "correct": [
      "az container create --resource-group myResourceGroup --name mycontainer --image mycontainerimage --restart-policy OnFailure"
    ],
    "body": "Você precisa definir uma política de reinicialização para o grupo de contêineres. Qual comando da CLI do Azure você deve usar?"
  },
  {
    "id": "030",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você desenvolve um aplicativo que será acessado por um fornecedor. Ele requer uma Assinatura de Acesso Compartilhado (SAS)  para acessar os serviços do Azure na assinatura de sua empresa.",
    "options": [
      "Sempre usar HTTPS",
      "Conceder permissão a vários recursos",
      "Usar os logs do Azure Monitor e do Armazenamento do Microsoft Azure para monitorar o aplicativo",
      "Definir uma política de acesso armazenada para uma SAS de serviço",
      "Definir um longo tempo de expiração"
    ],
    "correct": [
      "Sempre usar HTTPS",
      "Usar os logs do Azure Monitor e do Armazenamento do Microsoft Azure para monitorar o aplicativo",
      "Definir uma política de acesso armazenada para uma SAS de serviço"
    ],
    "body": "Você precisa proteger o SAS. Quais são as ações que você deve executar? Cada resposta apresenta uma solução completa."
  },
  {
    "id": "031",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você planeja gerar um token de Assinatura de Acesso Compartilhado (SAS) para acesso de leitura a um blob em uma conta de armazenamento.",
    "options": [
      "Chave de conta primária",
      "Chave de conta secundária",
      "Credenciais do Microsoft Entra ID atribuídas à função de Colaborador",
      "Credenciais do Microsoft Entra ID atribuídas à função de Leitor"
    ],
    "correct": [
      "Credenciais do Microsoft Entra ID atribuídas à função de Colaborador"
    ],
    "body": "Você precisa proteger o token de ser comprometido. O que você deve usar?"
  },
  {
    "id": "032",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você precisa gerar um token de Assinatura de Acesso Compartilhado que conceda permissão de leitura a um contêiner de blob.",
    "options": [
      "Resource = \"c\"",
      "Resource = \"b\"",
      "BlobContainerSasPermissions.Create",
      "BlobContainerSasPermissions.Read"
    ],
    "correct": [
      "Resource = \"c\"",
      "BlobContainerSasPermissions.Read"
    ],
    "body": "O que você deve usar para completar os espaços que faltam no segmento de código?",
    "code": "question-032.md"
  },
  {
    "id": "033",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você tem um aplicativo que grava dados no Azure Cosmos DB e precisa configurar o nível de consistência.",
    "options": [
      "Sessão",
      "Eventual",
      "Desatualização limitada",
      "Forte"
    ],
    "correct": [
      "Sessão"
    ],
    "body": "O Aplicativo deve oferecer prefixo consistente e leituras monotônicas. Qual nível de consistência você deve usar?"
  },
  {
    "id": "034",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você tem dois hosts Hyper-V chamados Host1 e Host2. O Host1 tem uma máquina virtual do Azure chamada VM1 que foi implantada usando um template personalizado do Azure Resource Manager.",
    "options": [
      "Na folha Gerenciamento de atualizações, clique em Habilitar.",
      "Na folha Visão geral, mova a VM1 para uma assinatura diferente.",
      "Na folha Reimplantar, clique em Reimplantar.",
      "Na folha Perfil, modifique o local de uso."
    ],
    "correct": [
      "Na folha Reimplantar, clique em Reimplantar."
    ],
    "body": "O que você deve fazer para mover a VM1 para o Host2?"
  },
  {
    "id": "035",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você baixou um modelo do Azure Resource Manager para implantar diversas máquinas virtuais. O modelo é baseado em uma máquina virtual atual, mas deve ser adaptado para referenciar uma senha administrativa. Você precisa ter certeza de que a senha não está armazenada em texto simples e está se preparando para criar os componentes necessários para atingir seu objetivo.",
    "options": [
      "Um Azure Key Vault",
      "Uma conta de Armazenamento do Azure",
      "Uma proteção de identidade do Microsoft Entra ID",
      "Uma política de acesso",
      "Uma política do Azure",
      "Uma política de backup"
    ],
    "correct": [
      "Um Azure Key Vault",
      "Uma política de acesso"
    ],
    "body": "Quais das opções a seguir você deve criar para atingir seu objetivo?"
  },
  {
    "id": "036",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua companhia tem um aplicativo Web chamado WebApp1. Você usa o WebJobs SDK para projetar uma tarefa em segundo plano do Serviço de Aplicativo acionada que invoca automaticamente uma função no código sempre que novos dados são recebidos em uma fila.",
    "options": [
      "Aplicativos Lógicos",
      "WebJobs",
      "Flow",
      "Functions"
    ],
    "correct": [
      "WebJobs"
    ],
    "body": "Você está se preparando para configurar o serviço que processa os dados da fila. Qual dos seguintes é o serviço que você deve usar?"
  },
  {
    "id": "037",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua companhia tem uma assinatura do Azure. Você precisa implantar um número de máquinas virtuais do Azure para a assinatura usando templates do Azure Resource Manager. As máquinas virtuais estarão incluídas em um único conjunto de disponibilidade.",
    "options": [
      "30",
      "20",
      "40",
      "10"
    ],
    "correct": [
      "20"
    ],
    "body": "Você precisa garantir que os templates ARM permitam que o máximo de máquinas virtuais possível permaneçam acessíveis no caso de um evento de falha ou manutenção. Qual valor você deve configurar na propriedade platformUpdateDomainCount?"
  },
  {
    "id": "038",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo Web de e-Commerce e deseja usar um Azure Key Vault para assegurar que os acessos ao aplicativo Web de e-Commerce sejam protegidos usando a autenticação do Serviço de Aplicativo do Azure e o Microsoft Entra ID.",
    "options": [
      "Executar o comando 'az keyvault secret'",
      "Habilitar o Azure AD Connect",
      "Habilitar uma Identidade de Serviço Gerenciada",
      "Criar uma entidade de serviço do Azure AD"
    ],
    "correct": [
      "Habilitar uma Identidade de Serviço Gerenciada"
    ],
    "body": "O que você deve fazer no aplicativo Web de e-Commerce?"
  },
  {
    "id": "039",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Esta questão requer que você avalie o texto entre colchetes para determinar se está correto. Se a afirmação estiver correta, selecione 'Nenhuma alteração é necessária.' Se a afirmação estiver incorreta, selecione a opção de resposta que torna a afirmação correta.",
    "options": [
      "Nenhuma alteração é necessária.",
      "Um segredo",
      "Um login hint",
      "Um ID de cliente"
    ],
    "correct": [
      "Nenhuma alteração é necessária."
    ],
    "body": "Seu locatário do Azure Active Directory Azure (Azure AD) tem uma assinatura do Azure vinculada a ele. Seu desenvolvedor criou um aplicativo móvel que obtém tokens de acesso do Azure AD usando o tipo de concessão implícita OAuth 2. O aplicativo móvel deve estar registrado no Azure AD. Você precisa de [um URI de redirecionamento] do desenvolvedor para fins de registro."
  },
  {
    "id": "040",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está criando um Azure Key Vault usando o PowerShell. Objetos deletados do key vault devem ser mantidos por um período de 90 dias.",
    "options": [
      "EnabledForDeployment",
      "EnablePurgeProtection",
      "EnabledForTemplateDeployment",
      "EnableSoftDelete"
    ],
    "correct": [
      "EnablePurgeProtection",
      "EnableSoftDelete"
    ],
    "body": "Quais dos seguintes parâmetros você deve usar em conjunto para atingir esse objetivo? (Selecione dois)"
  },
  {
    "id": "041",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "A assinatura do Azure da sua empresa inclui um espaço de trabalho do Azure Log Analytics. Sua empresa tem cem servidores locais que executam o Windows Server 2012 R2 ou o Windows Server 2016 e estão vinculados ao espaço de trabalho do Azure Log Analytics, que está configurado para recolher contadores de desempenho associados à segurança destes servidores ligados. Você deve configurar alertas com base nas informações coletadas pelo espaço de trabalho do Azure Log Analytics.",
    "options": [
      "O tipo de sinal do registro de atividades.",
      "O tipo de sinal do Log do Aplicativo.",
      "O tipo de sinal de métricas.",
      "O tipo de sinal do log de auditoria."
    ],
    "correct": [
      "O tipo de sinal de métricas."
    ],
    "body": "Você deve garantir que as regras de alerta permitam dimensões e que o tempo de criação de alerta seja reduzido ao mínimo. Além disso, uma única notificação de alerta deve ser criada quando o alerta for criado e quando o alerta for resolvido. Você precisa usar o tipo de sinal necessário ao criar as regras de alerta. Qual das alternativas a seguir é a opção que você deve usar?"
  },
  {
    "id": "042",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você está desenvolvendo uma aplicação MVC em .NET Core que permite consumidores buscarem acomodações para feriados de provedores independentes. Você quer implementar a Pesquisa do Azure para permitir que a aplicação pesquise pelo índice usando vários critérios para localizar documentos relacionados com as acomodações.",
    "options": [
      "Configurar a propriedade SearchMode da classe SearchParameter",
      "Configurar a propriedade QueryType da classe SearchParameter",
      "Configurar a propriedade Facets da classe SearchParameter",
      "Configurar a propriedade Filter da classe SearchParameter"
    ],
    "correct": [
      "Configurar a propriedade QueryType da classe SearchParameter"
    ],
    "body": "Você quer que a aplicação permita aos consumidores pesquisar pelo índice usando RegEx. O que você deve fazer?"
  },
  {
    "id": "043",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você está desenvolvendo uma aplicação MVC em .NET Core que permite consumidores buscarem acomodações para feriados de provedores independentes. Você quer implementar a Pesquisa do Azure para permitir que a aplicação pesquise pelo índice usando vários critérios para localizar documentos relacionados com as acomodações.",
    "options": [
      "Configurar a propriedade SearchMode da classe SearchParameter",
      "Configurar a propriedade QueryType da classe SearchParameter",
      "Configurar a propriedade Facets da classe SearchParameter",
      "Configurar a propriedade Filter da classe SearchParameter"
    ],
    "correct": [
      "Configurar a propriedade Filter da classe SearchParameter"
    ],
    "body": "Você quer que o aplicativo liste acomodações para feriados que estejam dentro de uma faixa de preço específica e que estejam a uma distância específica de um aeroporto. O que você deveria fazer?"
  },
  {
    "id": "044",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você é desenvolvedor de uma empresa que fornece serviço de gerenciamento de reservas na indústria do turismo e está implementando o Azure Search para as agências de turismo listadas na solução da sua empresa. Você cria o índice no Azure Search. Agora você precisa usar o Azure Search .NET SDK para importar os dados relevantes para o serviço Azure Search.",
    "options": [
      "1º: ",
      "2º: ",
      "3º: "
    ],
    "correct": [
      "Criar um objeto SearchlndexClient para conectar-se ao índice de pesquisa.",
      "Criar um IndexBatch que contenha o documentos que devem ser adicionados.",
      "Chame o método Documents.Index do SearchIndexClient e passe o IndexBatch."
    ],
    "body": "Quais são as três ações que você deve executar em sequência? Para responder, mova as ações apropriadas da lista de ações da esquerda para a direita e organize-as na ordem correta."
  },
  {
    "id": "045",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo C++ que é compilado em um aplicativo nativo chamado process.exe. O aplicativo aceita imagens como entrada e retorna imagens em um dos seguintes formatos de imagem: GIF, PNG ou JPEG. Você deve implantar o aplicativo como uma Função do Azure.",
    "options": [
      "\"type\":\"http\" / \"customHandler\" / \"description\" / false",
      "\"platform\":\"gcm\" / \"extensions\" / \"worker\" / true",
      "\"type\":\"http\" / \"languageWorker\" / \"path\" / true",
      "\"datatype\":\"stream\" / \"customHandler\" / \"description\" / false"
    ],
    "correct": [
      "\"type\":\"http\" / \"customHandler\" / \"description\" / false"
    ],
    "body": "Você precisa configurar a função e hospedar os arquivos json. Como você deve preencher os arquivos json?",
    "code": "question-045.md"
  },
  {
    "id": "046",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Uma empresa implementa uma conta do Azure Cosmos DB chamada Account1 para armazenar detalhes de produtos. Você precisa escrever uma consulta SQL parametrizada para obter itens do contêiner Produtos com base na categoria e no preço como parâmetros.",
    "options": [
      "SELECT * FROM Products p WHERE p.category = 'Category' AND p.price = 'Price'",
      "SELECT * FROM Products p WHERE p.category = @Category AND p.price = @Price",
      "SELECT * FROM Account1.Products p WHERE p.category = @Category AND p.price = @Price",
      "SELECT * FROM Account1 a WHERE a.products.category = 'Category' AND a.products.price = 'Price'"
    ],
    "correct": [
      "SELECT * FROM Products p WHERE p.category = @Category AND p.price = @Price"
    ],
    "body": "Qual consulta SQL você deve usar?"
  },
  {
    "id": "047",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você gerencia APIs em produção usando o Gerenciamento de API do Azure e precisa remover cabeçalhos X-Powered-By e X-AspNet-Version de uma resposta.",
    "options": [
      "<backend> <set-header name=\"X-Powered-By\" exists-action=\"delete\"> <set-header name=\"X-AspNet-Version\" exists-action=\"delete\"> <base /> </backend> <outbound> <base /> </outbound>",
      "<backend> <base /> </backend> <outbound> <set-header name=\"X-Powered-By\" exists-action=\"delete\"> <set-header name=\"X-AspNet-Version\" exists-action=\"delete\"> <base /> </outbound>",
      "<backend> <set-header name=\"X-Powered-By\" exists-action=\"append\"> <set-header name=\"X-AspNet-Version\" exists-action=\"append\"> <base /> </backend> <outbound> <base /> </outbound>",
      "<backend> <base /> </backend> <outbound> <set-header name=\"X-Powered-By\" exists-action=\"append\"> <set-header name=\"X-AspNet-Version\" exists-action=\"append\"> <base /> </outbound>"
    ],
    "correct": [
      "<backend> <base /> </backend> <outbound> <set-header name=\"X-Powered-By\" exists-action=\"delete\"> <set-header name=\"X-AspNet-Version\" exists-action=\"delete\"> <base /> </outbound>"
    ],
    "body": "Qual segmento de código você deve adicionar para completar o bloco acima?",
    "code": "question-047.md"
  },
  {
    "id": "048",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo .NET que inclui várias imagens de contêiner. O aplicativo será implantado nas Instâncias de Contêiner do Azure (ACI).",
    "options": [
      "Pods do Kubernetes",
      "Contêineres confidenciais",
      "Grupo de contêineres",
      "Implantação de rede virtual"
    ],
    "correct": [
      "Grupo de contêineres"
    ],
    "body": "Você precisa garantir que um compartilhamento de arquivos do Azure possa ser mapeado para cada contêiner do aplicativo. Qual configuração você deve usar?"
  },
  {
    "id": "049",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você tem 10 aplicativos em execução no Serviço de Aplicativo do Azure e precisa garantir que os aplicativos tenham acesso aos itens armazenados na Configuração de Aplicativos do Azure usando uma configuração comum.",
    "options": [
      "Identidades gerenciadas atribuídas pelo sistemas",
      "Uma identidade gerenciada atribuída pelo usuário",
      "Uma entidade de serviço com permissões para a Configuração de Aplicativos do Azure",
      "Credenciais do desenvolvedor no código"
    ],
    "correct": [
      "Uma identidade gerenciada atribuída pelo usuário"
    ],
    "body": "Senhas ou chaves não devem ser usadas. Qual solução você pode usar?"
  },
  {
    "id": "050",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um conjunto de templates aninhados do Azure Resource Manager para implantar recursos no Azure. Você cria um template chamado mainTemplate.json que contém referência para os seguintes templates: linkedTemplate1.json e linkedTemplate2.json. Você precisa armazenar todos esses templates no Azure. Existem os seguintes requisitos: ",
    "requirements": [
      "Armazenar os templates no Azure.",
      "Permitir versionamento dos templates.",
      "Gerenciar o acesso aos templates com RBAC.",
      "Garantir que usuários tenham acesso de leitura aos templates.",
      "Permitir que usuários implantem templates."
    ],
    "options": [
      "blueprint artifact template create",
      "mainTemplate.json",
      "linkedTemplate1.json",
      "ts create",
      "storage account create",
      "linkedTemplate2.json"
    ],
    "correct": [
      "ts create",
      "mainTemplate.json"
    ],
    "body": "Como você deve completar o comando acima?",
    "code": "question-050.md"
  },
  {
    "id": "051",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um serviço onde consumidores podem reportar notícias a partir de um browser usando o Azure Web PubSub. O serviço será implementado como um Aplicativo de Função do Azure que usa o subprotocolo WebSocket JSON para receber as notícias. Você precisa implementar as conexões para o Aplicativo de Função do Azure.",
    "options": [
      "user",
      "system",
      "message",
      "connected",
      "webPubSubTrigger",
      "webPubSubConnection"
    ],
    "correct": [
      "user",
      "webPubSubTrigger"
    ],
    "body": "Como você deve configurar a conexão? Marque as alternativas que completam o bloco de código acima.",
    "code": "question-051.md"
  },
  {
    "id": "052",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está construindo uma aplicação de Software como serviço (SaaS) que analisa dados de DNA e é executada em uma Máquina virtual do Azure em uma zona de disponibilidade. Os dados serão armazenados em discos gerenciados ligados à VM. Você tem os seguintes requisitos:",
    "requirements": [
      "A aplicação deve ser capaz de rapidamente reverter os dados para uma versão anterior em caso de falha sistêmica.",
      "A aplicação deve minimizar o impacto no caso de uma falha no datacenter do Azure."
    ],
    "options": [
      "Premium SSD com redundância de armazenamento local (LRS)",
      "Standard SSD com redundância de armazenamento de Zona (ZRS)",
      "Premium SSD com redundância de armazenamento de Zona (ZRS)",
      "Premium SSD com redundância de armazenamento geográfica (GRS)"
    ],
    "correct": [
      "Premium SSD com redundância de armazenamento de Zona (ZRS)"
    ],
    "body": "Você precisa provisionar o Disco gerenciado do Azure para a VM para maximizar a performance e cumprir os requisitos. Qual tipo de disco você deve usar?"
  },
  {
    "id": "053",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo uma aplicação que inclui dois contêineres do Docker. A aplicação deve cumprir os seguintes requisitos:",
    "options": [
      "Configurar o Ciclo de Vida como grupo de contêineres e Volume de Armazenamento como Diretório Vazio",
      "Configurar o Ciclo de Vida como imagem de contêiner e Volume de Armazenamento como Clone de repositório Git",
      "Configurar o Ciclo de Vida como grupo de recursos e Volume de Armazenamento como Compartilhamento de arquivos do Azure",
      "Configurar o Ciclo de Vida como grupo de contêineres e Volume de Armazenamento como Clone de repositório Git",
      "Configurar o Ciclo de Vida como grupo de contêineres e Volume de Armazenamento como Compartilhamento de arquivos do Azure"
    ],
    "correct": [
      "Configurar o Ciclo de Vida como grupo de contêineres e Volume de Armazenamento como Clone de repositório Git"
    ],
    "body": "Você deve configurar as Instâncias de Contêiner do Azure para a aplicação, como deve ficar sua configuração?",
    "requirements": [
      "Os contêineres não devem ter permissão de administrador",
      "Os contêineres devem ser implantados como Instâncias de Contêiner do Azure (ACI) usando um arquivo YAML",
      "Os contêineres devem ter o ciclo de vida, recursos, rede local e volume de armazenamento compartilhados",
      "O volume de armazenamento deve persistir durante quedas de contêiner",
      "O volume de armazenamento deve ser reimplantado sempre que os contêineres forem parados ou reiniciados"
    ]
  },
  {
    "id": "054",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você precisa implementar o método GetCredentials da classe Processing.",
    "options": [
      "MSITokenProvider(\"...\", null)",
      "tp.GetAccessTokenAsync(\"...\")",
      "AzureServiceTokenProvider()",
      "StringTokenProvider(\"storage\", \"msi\")",
      "tp.GetAuthenticationHeaderAsync(CancellationToken.None)"
    ],
    "correct": [
      "tp.GetAccessTokenAsync(\"...\")",
      "AzureServiceTokenProvider()"
    ],
    "body": "Quais segmentos você deve adicionar para completar o código?",
    "code": "question-054.md"
  },
  {
    "id": "055",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você precisa garantir que o código atenda requisitos de recuperação de desastre.",
    "options": [
      "true",
      "SingleTransferContext",
      "ShouldTransferCallbackAsync",
      "false",
      "DirectoryTransferContext",
      "ShouldOverwriteCallBackAsync"
    ],
    "correct": [
      "true",
      "SingleTransferContext",
      "ShouldOverwriteCallBackAsync"
    ],
    "body": "Quais segmentos você deve adicionar para completar o código?",
    "code": "question-055.md"
  },
  {
    "id": "056",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está implementando um serviço Web ASP.NET Core que vai executar em um Aplicativo Web do Azure. O serviço web vai usar um banco de dados SQL Server on-premise para armazenamento, e também inclui um WebJob que processa atualizações nos dados. 4 clientes vão usar o serviço web.",
    "options": [
      "4 instâncias de VM e camada de serviço Standard",
      "8 instâncias de VM e camada de serviço de Consumo",
      "4 instâncias de VM e camada de serviço Isolada",
      "8 instâncias de VM e camada de serviço Isolada",
      "16 instâncias de VM e camada de serviço Standard"
    ],
    "correct": [
      "4 instâncias de VM e camada de serviço Isolada"
    ],
    "body": "Como você deve configurar o Serviço de Aplicativo do Azure?",
    "requirements": [
      "Cada instância do WebJob processa dados para um único cliente e deve executar como uma instância Singleton",
      "Cada implantação deve ser testada usando slots de implantação antes de acessar dados de produção",
      "Os custos do Azure devem ser mínimos",
      "Os recursos do Azure devem estar localizados em uma rede isolada"
    ]
  },
  {
    "id": "057",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você é um desenvolvedor de uma companhia de Software como serviço (SaaS) que usa uma Função do Azure para processar pedidos. A função atualmente é executada em um Aplicativo de Função do Azure que é disparado pelo Armazenamento de Filas do Azure. Você está se preparando para migrar a Função do Azure para o Kubernetes usando o Kubernetes-based Event Driven Autoscaling (KEDA).",
    "options": [
      "código da Função do Azure",
      "Intervalo de polling",
      "String de conexão do Armazenamento do Azure"
    ],
    "correct": [
      "Deployment",
      "ScaledObject",
      "Secret"
    ],
    "body": "Você precisa configurar os Kubernetes Custom Resource Definitions (CRD) para a Função do Azure. Quais CRDs você deve configurar?"
  },
  {
    "id": "058",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está criando um script do CLI do Azure que cria um Aplicativo Web do Azure e serviços relacionados do Serviço de aplicativo do Azure. O aplicativo web usa as seguintes variáveis: ",
    "options": [
      "(1)",
      "(2)",
      "(3)",
      "(4)",
      "(5)"
    ],
    "correct": [
      "az appservice plan create",
      "az webapp create",
      "--plan $webappname",
      "az webapp deployment",
      "--repo-url $gitrepo --branch master --manual-integration"
    ],
    "body": "Você precisa automaticamente implantar o código do GitHub para o recém criado aplicativo web. Como você deve completar o script?",
    "requirements": [
      "$gitrepo = https://github.com/Salgado2004/Angular-Ecommerce-UFPR-Faz-Sistema",
      "$webappname = ecommerceUFPRAngular"
    ],
    "code": "question-058.md"
  },
  {
    "id": "059",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você desenvolve e implanta uma API do Serviço de Aplicativo do Azure em um slot de implantação chamado 'Desenvolvimento'. Você cria slots de implantação adicionais denominados 'Teste' e 'Produção', e também habilita a troca automática no slot de implantação de produção. Você precisa garantir que os scripts sejam executados e que os recursos estejam disponíveis antes que ocorra uma operação de troca.",
    "options": [
      "Habilitar a troca automática no slot de teste e depois implantar o aplicativo no slot de teste",
      "Atualizar o arquivo web.config para incluir o elemento applicationInitialization e especificar ações de inicialização personalizadas para executar os scripts.",
      "Desabilitar a troca automática, atualizar o aplicativo com um método 'statuscheck' para executar os scripts, reabilitar a troca automática e implantar o aplicativo no slot de produção.",
      "Atualizar o aplicativo com um método chamado 'statuscheck' para executar os scripts, atualizar as configurações do aplicativo. Depois colocar o WEBSITE_SWAP_WARMUP_PING_PATH e WEBSITE_SWAP_WARMUP_PING_STATUSES com um caminho para o novo método e códigos de resposta apropriados."
    ],
    "correct": [
      "false",
      "true",
      "false",
      "true"
    ],
    "body": "Marque 'verdadeiro' se as soluções apresentadas atendem o objetivo, caso contrário, marque 'falso'"
  },
  {
    "id": "060",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você desenvolve uma oferta de software como serviço (SaaS) para gerenciar fotografias. Usuários fazem upload de fotos para um serviço web que armazena as fotos no Armazenamento de Blobs dos Azure. O tipo da conta de armazenamento é General-purpose V2. Quando as fotos são enviadas, elas devem ser processadas para produzir e salvar uma versão mobile-friendly da imagem. Esse processo de iniciar em menos de 1 minuto. Como você pode fazer isso?",
    "options": [
      "Usar Eventos do Armazenamento de Blobs para iniciar o processamento",
      "Converter a conta de armazenamento do Azure para uma conta de Blobs de Blocos",
      "Mover o processamento das imagens para um Aplicativo de Função do Azure ativado pelo upload de blobs",
      "Crie um aplicativo do Azure Function que use o modelo de hospedagem de Consumo e que seja acionado a partir do upload do blob."
    ],
    "correct": [
      "false",
      "false",
      "true",
      "false"
    ],
    "body": "Marque 'verdadeiro' se as soluções apresentadas atendem o objetivo, caso contrário, marque 'falso'"
  },
  {
    "id": "061",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um Docker/Go usando o aplicativo Web do serviço de aplicativo do Azure para contêineres. Você planeja executar o contêiner em um serviço de aplicativo no Linux e identifica uma imagem do contêiner Docker a ser usada. Nenhum dos seus grupos de recursos atuais reside em um local que suporte Linux.",
    "options": [
      "1º: ",
      "2º: ",
      "3º: "
    ],
    "correct": [
      "az group create",
      "az appservice plan create",
      "az webapp create"
    ],
    "body": "Você deve minimizar o número de grupos de recursos necessários, precisa criar o aplicativo e realizar uma implantação inicial. Quais são os três comandos da CLI do Azure, em ordem, que você deve usar para desenvolver a solução?"
  },
  {
    "id": "062",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "UFPR FAZ SISTEMA tem um aplicativo web em Angular que é executado no Docker e está sendo migrado para o Azure. O aplicativo foi mapeado para o domínio www.ecommerce.ufpr.faz.sistema.com.br. Você precisa provisionar o Serviço de Aplicativo do Azure para hospedar a imagem do docker e mapear o domínio personalizado para o plano de serviço chamado AppServiceLinuxDockerPlan.",
    "options": [
      "1º: ",
      "2º: ",
      "3º: ",
      "4º: "
    ],
    "correct": [
      "#/bin/bash appName=\"UFPRFazSistemaWeb$random\" \\ location=\"WestUS\" \\ dockerHubContainerPath=\"UFPR/publicweb:v1\" \\ domain=\"https://www.ecommerce.ufpr.faz.sistema.com.br\"",
      "az webapp create --name $appName --plan AppServiceLinuxDockerPlan --resource-group ufprFazSistemaWebRG",
      "az webapp config container set --docker-custom-image-name $dockerHubContainerPath --name $appName --resource-group ufprFazSistemaWebRG",
      "az webapp config hostname add --webapp-name $appName --resource-group ufprFazSistemaWebRG --hostname $domain"
    ],
    "body": "Em qual ordem você deve executar os comandos de CLI abaixo para desenvolver a solução?"
  },
  {
    "id": "063",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Seu time precisa implatar um contêiner usando as Instâncias de Contêiner do Azure. O contêiner precisa persistir dados via um ponto de montagem. ",
    "options": [
      "Armazenamento de blobs do Azure",
      "Armazenamento de arquivos do Azure",
      "Azure Cosmos DB",
      "Banco de dados SQL do Azure"
    ],
    "correct": [
      "Armazenamento de arquivos do Azure"
    ],
    "body": "Qual serviço você deve usar para montar o armazenamento no contêiner?"
  },
  {
    "id": "064",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você precisa implantar um contêiner baseado em Docker em um aplicativo Web do Azure. A imagem do Docker está em um Registro de Contêiner do Azure, e todos os recursos pertencem à sua assinatura.",
    "options": [
      "(1)",
      "(2)",
      "(3)"
    ],
    "correct": [
      "az appservice plan create",
      "az webapp create",
      "az webapp config"
    ],
    "body": "Como você deve completar os comandos do Azure CLI acima?",
    "code": "question-064.md"
  },
  {
    "id": "065",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Seu time precisa criar um contêiner em uma conta existente do Azure Cosmos DB. Atualmente, não existe nenhuma propriedade no conjunto de dados adequada para ser usada como chave de partição.",
    "options": [
      "Concatenar diferentes propriedades para criar uma chave de partição",
      "Escolher uma propriedade que não tenha valores nulos",
      "Usar uma propriedade de data/hora para criar uma chave de partição",
      "Usar um número inteiro para criar uma chave de partição"
    ],
    "correct": [
      "Concatenar diferentes propriedades para criar uma chave de partição",
      "Usar uma propriedade de data/hora para criar uma chave de partição"
    ],
    "body": "Quais são as outras opções disponíveis para especificar as chave de partição? (Selecione todas as corretas)"
  },
  {
    "id": "066",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Um membro da sua equipe executou o seguinte script do PowerShell em uma assinatura do Azure: ",
    "options": [
      "MongoDB",
      "Postgrees",
      "NoSQL",
      "Cassandra",
      "Gremlim"
    ],
    "correct": [
      "NoSQL"
    ],
    "body": "Com base no código, qual é a API do Cosmos DB que será utilizada?",
    "code": "question-066.md"
  },
  {
    "id": "067",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Um membro da sua equipe executou o seguinte script do PowerShell em uma assinatura do Azure: ",
    "options": [
      "400",
      "200",
      "4000",
      "1000",
      "100"
    ],
    "correct": [
      "400"
    ],
    "body": "Com base no código, quantas RUs serão provisionadas para o contêiner?",
    "code": "question-067.md"
  },
  {
    "id": "068",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Seu time precisa implantar uma aplicação Angular em um Aplicativo Web do Azure. Eles desejam coletar dados de telemetria para a aplicação.",
    "options": [
      "Criar um recurso do Application Insights",
      "Criar uma Regra de Coleção de Dados",
      "Configurar o aplicativo Web para enviar dados de telemetria para o Application Insights",
      "Habilitar o Application Insights no aplicativo Web",
      "Configurar uma extensão para o aplicativo Web do Azure"
    ],
    "correct": [
      "Criar um recurso do Application Insights",
      "Configurar o aplicativo Web para enviar dados de telemetria para o Application Insights",
      "Habilitar o Application Insights no aplicativo Web"
    ],
    "body": "O que deve ser implementado para cumprir esse requisito? (Selecione todas as corretas)"
  },
  {
    "id": "069",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Seu time tem uma aplicação Web implantada em uma Máquina Virtual do Azure. A aplicação é acessada por usuários ao redor do mundo. O time precisa garantir a disponibilidade da aplicação e monitorar a performance em intervalos regulares a partir de diferentes regiões do mundo.",
    "options": [
      "Habilitar a configuração de Diagnósticos para a Máquina Virtual",
      "Configurar o Monitoramento de Aplicativos do Azure",
      "Configurar Testes de Disponibilidade a partir de um recurso do Application Insights",
      "Conectar a máquina virtual a um espaço de trabalho do Log Analytics",
      "Criar uma aplicação personalizada para monitorar a performance da aplicação"
    ],
    "correct": [
      "Configurar Testes de Disponibilidade a partir de um recurso do Application Insights"
    ],
    "body": "Qual das ações a seguir você deve executar para atender a esses requisitos com o menor esforço possível?"
  },
  {
    "id": "070",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Seu time tem uma aplicação ASP.Net Core v8 que precisa utilizar o recurso de Feature Flags do Azure App Configuration.",
    "options": [
      "useFeatureFlags();",
      "useAzureAppConfiguration();",
      "addAzureAppConfiguration",
      "AddFeatureFlags"
    ],
    "correct": [
      "useFeatureFlags();",
      "addAzureAppConfiguration"
    ],
    "body": "Como você deve completar a configuração do arquivo Program.cs para atender a esse requisito?",
    "code": "question-070.md"
  },
  {
    "id": "071",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Sua companhia tem uma conta de armazenamento do Azure V2 de Propósito Geral. Existem objetos armazenados na conta que estão na camada de acesso Arquivos.",
    "options": [
      "Entre 1 e 60 minutos",
      "Entre 1 e 15 horas",
      "Entre 2 e 3 dias"
    ],
    "correct": [
      "Entre 1 e 15 horas"
    ],
    "body": "Qual opção a seguir corresponde ao tempo necessário para acessar um objeto na camada de acesso Arquivos?"
  },
  {
    "id": "072",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Seu time está desenvolvendo uma aplicação SpringBoot que será implantada em um Serviço de Aplicativo do Azure. Há um requisito para garantir que um armazenamento de dados seja usado para armazenar o estado da sessão em todo o aplicativo. Além disso, as respostas HTTP completas frequentes também devem ser armazenadas no armazenamento de dados.",
    "options": [
      "Uma conta de Armazenamento do Azure",
      "Cache do Azure para Redis",
      "Azure Cosmos DB",
      "Funções do Azure",
      "Aplicativos Lógicos"
    ],
    "correct": [
      "Cache do Azure para Redis"
    ],
    "body": "Qual opção a seguir pode ser usada para cumprir esse requisito?"
  },
  {
    "id": "073",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você está desenvolvendo um programa que interage com o Cache do Azure para Redis. Você precisa escrever um método que irá deletar chaves do cache.",
    "options": [
      "IDatabase database = redis.GetDatabase()",
      "ICache database = redis.GetCache()",
      "database.KeyDelete(keyName)",
      "database.StringSet(keyName)"
    ],
    "correct": [
      "IDatabase database = redis.GetDatabase()",
      "database.KeyDelete(keyName)"
    ],
    "body": "Complete o bloco de código acima para cumprir esse requisito.",
    "code": "question-073.md"
  },
  {
    "id": "074",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Qual recurso do Application Insights a seguir permite que você veja a performance e quantidade de falhas da sua aplicação Web em quase tempo real?",
    "options": [
      "Profiler",
      "Live Metrics Stream",
      "Smart Detection",
      "Snapshot Debugger"
    ],
    "correct": [
      "Live Metrics Stream"
    ]
  },
  {
    "id": "075",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Sua equipe planeja fazer uso do Azure Cosmos DB. Os dados serão armazenados como pares de chave/valor.",
    "options": [
      "NoSQL",
      "MongoDB",
      "Cassandra",
      "Tabelas"
    ],
    "correct": [
      "Tabelas"
    ],
    "body": "Qual API do Cosmos DB você deve usar?"
  },
  {
    "id": "076",
    "exam": "AZ204",
    "type": "select",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Sua equipe acabou de configurar um perfil do Azure CDN e um endpoint. A aplicação Web será usada para armazenar e retornar imagens para um usuário. Você precisa configurar o cache do Azure CDN. Abaixo segue um exemplo da URL de acesso: ",
    "options": [
      "Bypass cache",
      "Override",
      "Set if missing"
    ],
    "correct": [
      "Override"
    ],
    "body": "O cache das imagens deve expirar depois de uma hora. O que você deve configurar como comportamento de caching?",
    "requirements": [
      "http://www.cloudportalhub.com/images/image1.jpg?quality=high"
    ]
  },
  {
    "id": "077",
    "exam": "AZ204",
    "type": "select",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Sua equipe acabou de configurar um perfil do Azure CDN e um endpoint. A aplicação Web será usada para armazenar e retornar imagens para um usuário. Você precisa configurar o cache do Azure CDN. Abaixo segue um exemplo da URL de acesso: ",
    "options": [
      "Ignore query strings",
      "Bypass caching behavior",
      "Cache every unique URL"
    ],
    "correct": [
      "Cache every unique URL"
    ],
    "body": "O cache das imagens deve expirar depois de uma hora. O que você deve configurar como comportamento da string de query do cache?",
    "requirements": [
      "http://www.cloudportalhub.com/images/image1.jpg?quality=high"
    ]
  },
  {
    "id": "078",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Qual recurso do Application Insights a seguir permite que você substitua ou descarte completamente um item de telemetria?",
    "options": [
      "Funnels",
      "Telemetry Processors",
      "Telemetry Initializers",
      "Distributed Tracing"
    ],
    "correct": [
      "Telemetry Processors"
    ]
  },
  {
    "id": "079",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo Web que irá interagir com o armazenamento de Blobs em uma conta do Armazenamento do Azure. Você criou um objeto de aplicativo no Azure AD. A aplicação web fará uso deste objeto de aplicativo. Os usuários farão login no aplicativo por meio de suas credenciais do Azure AD. Essas credenciais serão então usadas para acessar os objetos armazenados no armazenamento de blobs. Você precisa definir a permissão e o tipo corretos quando se trata de definir a permissão da API para armazenamento de blobs para o objeto de aplicativo do Azure AD.",
    "options": [
      "De aplicativo",
      "Delegado"
    ],
    "correct": [
      "Delegado"
    ],
    "body": "Qual tipo de permissão você deve usar?"
  },
  {
    "id": "080",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo Web que irá interagir com o armazenamento de Blobs em uma conta do Armazenamento do Azure. Você criou um objeto de aplicativo no Azure AD. A aplicação web fará uso deste objeto de aplicativo. Os usuários farão login no aplicativo por meio de suas credenciais do Azure AD. Essas credenciais serão então usadas para acessar os objetos armazenados no armazenamento de blobs. Você precisa definir a permissão e o tipo corretos quando se trata de definir a permissão da API para armazenamento de blobs para o objeto de aplicativo do Azure AD.",
    "options": [
      "user.Read",
      "user.Write",
      "user_impersonation"
    ],
    "correct": [
      "user_impersonation"
    ],
    "body": "Qual permissão você deve usar?"
  },
  {
    "id": "081",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Sua equipe precisa publicar um aplicativo Web em um Aplicativo Web do Azure. O aplicativo Web precisa buscar segredos de um recurso do Azure Key Vault. Você deve garantir que o aplicativo da web possa fazer isso sem a necessidade de incorporar qualquer tipo de credencial no aplicativo da web.",
    "options": [
      "Habilitar a vinculação SSL para o Aplicativo Web do Azure",
      "Configurar o CORS para o aplicativo Web do Azure",
      "Configurar uma identidade gerenciada para o aplicativo Web do Azure",
      "Atribuir um certificado autoassinado para o aplicativo web"
    ],
    "correct": [
      "Configurar uma identidade gerenciada para o aplicativo Web do Azure"
    ],
    "body": "Qual das opções a seguir pode ser implementada para este requisito?"
  },
  {
    "id": "082",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua equipe precisa implantar uma Instância de Contêiner do Azure que recebe um segredo na inicialização.",
    "options": [
      "(1)",
      "(2)"
    ],
    "correct": [
      "--secrets",
      "--secrets-mount-path"
    ],
    "body": "Como você deve completar o comando acima?",
    "code": "question-082.md"
  },
  {
    "id": "083",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está configurando um Aplicativo Web Estático do Azure e precisa garantir que todos os usuários sejam autenticados antes de acessarem a aplicação.",
    "options": [
      "headers",
      "response",
      "routes",
      "routeTo",
      "responseOverrides"
    ],
    "correct": [
      "response",
      "responseOverrides"
    ],
    "body": "Como você deve completar a configuração de roteamento acima?",
    "code": "question-083.md"
  },
  {
    "id": "084",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua equipe atualmente cuida de um serviço de Gerenciamento de API do Azure. Você precisa implementar caching.",
    "options": [
      "(1)",
      "(2)"
    ],
    "correct": [
      "cache-lookup",
      "cache-store"
    ],
    "body": "Como você deve completar a política acima?",
    "code": "question-084.md"
  },
  {
    "id": "085",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua empresa está desenvolvendo um sistema. O sistema deve ter a capacidade de enviar dados usando uma fila de mensagens. Eles desejam utilizar um serviço do Azure que atenda os seguintes requisitos: ",
    "options": [
      "Armazenamento de Filas do Azure",
      "Barramento de serviço do Azure",
      "Grade de eventos do Azure",
      "Hubs de eventos do Azure"
    ],
    "correct": [
      "Barramento de serviço do Azure"
    ],
    "body": "Qual serviço do Azure você deve sugerir?",
    "requirements": [
      "O tamanho da fila não deve ultrapassar 80 GB",
      "A fila deve suportar ordenação de mensagens FIFO (First-in-First-out)"
    ]
  },
  {
    "id": "086",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua empresa precisa desenvolver uma solução que atenda os seguintes requisitos: ",
    "options": [
      "Armazenamento de Filas do Azure",
      "Barramento de serviço do Azure",
      "Grade de eventos do Azure",
      "Hubs de eventos do Azure"
    ],
    "correct": [
      "Hubs de eventos do Azure"
    ],
    "body": "",
    "requirements": [
      "Cada dispositivo produz cerca de 1 MB de dados por dia",
      "Os dados devem ser armazenados no Armazenamento de Blobs do Azure",
      "Múltiplos dispositivos devem enviar dados através de um serviço do Azure",
      "Atualmente existem cerca de 1000 dispositivos usados pelos usuários da empresa"
    ]
  },
  {
    "id": "087",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você precisa implantar uma Instância de Contêiner do Azure usando um template YAML. A instância precisa acessar segredos através de um ponto de montagem.",
    "options": [
      "(1)",
      "(2)"
    ],
    "correct": [
      "volumeMounts",
      "volumes"
    ],
    "body": "Como você deve completar o template YAML para cumprir esse requisito?",
    "code": "question-087.md"
  },
  {
    "id": "088",
    "exam": "AZ204",
    "type": "select",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua equipe atualmente cuida de um serviço de Gerenciamento de API do Azure. Eles precisam configurar uma política em que uma mensagem de erro é passada para o header de resposta se uma requisição não autorizada é enviada para o serviço de API.",
    "options": [
      "backend / request / backend",
      "on-error / request / on-error",
      "outbound / context / on-error",
      "on-error / context / on-error",
      "backend / context / backend"
    ],
    "correct": [
      "on-error / context / on-error"
    ],
    "body": "Qual alternativa corresponde aos trechos para completar a política acima?",
    "code": "question-088.md"
  },
  {
    "id": "089",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Qual das opções a seguir são os modos de indexação disponíveis no Azure Cosmos DB? Selecione duas respostas",
    "options": [
      "Nenhum",
      "Composição",
      "Forte",
      "Sessão",
      "Consistente"
    ],
    "correct": [
      "Nenhum",
      "Consistente"
    ]
  },
  {
    "id": "090",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua equipe atualmente cuida de uma aplicação Web implantada em um Aplicativo Web do Azure, que faz parte da camada Básica do Plano de serviço de aplicativo. Eles precisam desenvolver um script do PowerShell que possa ser usado para criar um slot de implantação chamado \"staging\" e fazer uma nova implantação do aplicativo a partir de um repositório do GitHub.",
    "options": [
      "Set-AzAppServicePlan / New-AzWebAppSlot / Set-AzResource",
      "Set-AzResource / New-AzWebApp / Set-AzWepApp",
      "New-AzAppServicePlan / New-AzWebAppSlot / Set-AzWebApp",
      "New-AzAppServicePlan / New-AzWebAppSlot / Set-AzResource"
    ],
    "correct": [
      "Set-AzAppServicePlan / New-AzWebAppSlot / Set-AzResource"
    ],
    "body": "Você deve completar o código PowerShell acima para atingir esse objetivo.",
    "code": "question-090.md"
  },
  {
    "id": "091",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Seu time possui uma conta do Azure Cosmos DB, que contém um contêiner chamado \"products\". Os desenvolvedores querem executar a seguinte query: ",
    "options": [
      "path",
      "property",
      "index",
      "compositeIndexes"
    ],
    "correct": [
      "path",
      "compositeIndexes"
    ],
    "body": "Como você deve completar a política de indexação acima?",
    "code": "question-091.md",
    "requirements": [
      "SELECT * FROM products p ORDER BY p.rating, p.code"
    ]
  },
  {
    "id": "092",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Seu time possui uma conta do Azure Cosmos DB, que contém um contêiner chamado \"products\". Eles querem adicionar um trigger que irá garantir que a propriedade \"rating\" tenha um valor default sempre que um novo item for adicionado ao contêiner.",
    "options": [
      "context.getRequest()",
      "context.getResponse()",
      "request.setBody(item)",
      "response.setBody(item)"
    ],
    "correct": [
      "context.getRequest()",
      "request.setBody(item)"
    ],
    "body": "Selecione as alternativas que completam o código acima.",
    "code": "question-092.md"
  },
  {
    "id": "093",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Sua equipe está usando o Application Insights para monitorar em tempo real uma aplicação Web ASP.NET.",
    "options": [
      "Smart Detection",
      "Profiler",
      "Snapshot Debugger",
      "Live Metrics Stream"
    ],
    "correct": [
      "Snapshot Debugger"
    ],
    "body": "Qual dos recursos a seguir pode ser usado para recuperar o código de status e as variáveis quando uma exceção ocorrer na aplicação .NET?"
  },
  {
    "id": "094",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Seu time planeja utilizar o Cache do Azure para Redis. Eles querem garantir que os dados em cache estejam disponíveis mesmo no evento de uma falha do hardware.",
    "options": [
      "Criar o Cache do Azure para Redis na camada Standard e habilitar Persistência de Dados",
      "Criar o Cache do Azure para Redis na camada Premium e habilitar Persistência de Dados",
      "Criar o Cache do Azure para Redis na camada Standard e configurar Encriptação de disco",
      "Criar o Cache do Azure para Redis na camada Premium e configurar Encriptação de disco"
    ],
    "correct": [
      "Criar o Cache do Azure para Redis na camada Premium e habilitar Persistência de Dados"
    ],
    "body": "O que eles devem configurar para atingir esse objetivo e garantir que os custos sejam mantidos no mínimo?"
  },
  {
    "id": "095",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Sua empresa quer testar a responsividade de uma aplicação Web. A aplicação está disponível na Internet. A seguir estão os requisitos chave: ",
    "options": [
      "Configurar uma Função do Azure que possa rastrear a disponibilidade da aplicação",
      "Usar o recurso de teste Multi-step Web do Application Insights",
      "Usar o recurso de teste Standard do Application Insights",
      "Criar outra aplicação que implemente o método TrackAvailability()"
    ],
    "correct": [
      "Usar o recurso de teste Standard do Application Insights"
    ],
    "body": "Qual opção a seguir você deve escolher para implementar os requisitos?",
    "requirements": [
      "A aplicação Web deve ser testada a cada 5 minutos para saber se está executando",
      "Alertas devem ser gerados se o site não estiver carregando corretamente",
      "Todas as requisições de dependência feitas pela aplicação também devem ser testadas",
      "O mínimo de esforço deve ser usado para implementar esses requisitos"
    ]
  },
  {
    "id": "096",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Seu time planeja utilizar o serviço de CDN do Azure em sua aplicação Web. Você precisa entender o fluxo de requisições que ocorre no CDN.",
    "options": [
      "1º: ",
      "2º: ",
      "3º: ",
      "4º: "
    ],
    "correct": [
      "O usuário faz uma requisição de um recurso. A requisição é enviada do CDN do Azure para o Ponto de presença com a melhor performance com base na localização.",
      "O servidor de borda verifica se já possui o recurso. Se não possuir, uma requisição é feita para o servidor de origem.",
      "O servidor de origem retorna o recurso para o servidor de borda no Ponto de presença. O recurso é adicionado ao cache e também enviado ao usuário.",
      "As requisições subsequentes dos usuários para o mesmo Ponto de presença irão receber o recurso direto do cache."
    ],
    "body": "Ordene corretamente os passos do workflow de requisições."
  },
  {
    "id": "097",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você está desenvolvendo um programa que interage com o Cache do Azure para Redis e precisa decidir o tipo de dado Redis ideal para atender o seguinte requisito: ",
    "options": [
      "set",
      "list",
      "channel"
    ],
    "correct": [
      "list"
    ],
    "body": "Qual tipo de dado você deve escolher para atender ao requisito?",
    "requirements": [
      "Deve poder acessar o item mais recente do cache"
    ]
  },
  {
    "id": "098",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você está desenvolvendo um programa que interage com o Cache do Azure para Redis e precisa decidir o tipo de dado Redis ideal para atender o seguinte requisito: ",
    "options": [
      "set",
      "list",
      "channel"
    ],
    "correct": [
      "channel"
    ],
    "body": "Qual tipo de dado você deve escolher para atender ao requisito?",
    "requirements": [
      "Deve suportar o sistema de mensageria Publicar/Assinar"
    ]
  },
  {
    "id": "099",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você está desenvolvendo um programa que interage com o Cache do Azure para Redis e precisa decidir o tipo de dado Redis ideal para atender o seguinte requisito: ",
    "options": [
      "set",
      "list",
      "channel"
    ],
    "correct": [
      "set"
    ],
    "body": "Qual tipo de dado você deve escolher para atender ao requisito?",
    "requirements": [
      "Deve armazenar uma coleção de itens relacionados"
    ]
  },
  {
    "id": "100",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Qual recurso do Application Insights a seguir pode ser usado para reduzir dados de telemetria enquanto preserva uma análise estatística dos dados da aplicação.",
    "options": [
      "Funnels",
      "Performance",
      "Sampling",
      "Telemetry Initializers"
    ],
    "correct": [
      "Sampling"
    ]
  },
  {
    "id": "101",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo uma aplicação Web que busca uma string de conexão em um recurso do Azure Key Vault para acessar um banco de dados SQL do Azure.",
    "options": [
      "SecretClient",
      "DefaultCredential",
      "AzureTokenCredential",
      "DefaultAzureCredential",
      "TokenClient"
    ],
    "correct": [
      "SecretClient",
      "DefaultAzureCredential"
    ],
    "body": "Você precisa completar o código acima para buscar a string de conexão.",
    "code": "question-101.md"
  },
  {
    "id": "102",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Sua equipe precisa hospedar uma aplicação em uma Máquina Virtual do Azure. A aplicação precisa acessar chaves de criptografia armazenadas em um recurso do Azure Key Vault. Você deve garantir que a aplicação possa acessar com segurança as chaves sem incluir nenhum segredo no código. Identidades relacionadas aos recursos no Microsoft Entra ID devem ser excluídas automaticamente quando os recursos associados forem excluídos.",
    "options": [
      "Habilitar uma Identidade gerenciada atribuída pelo sistema para a máquina virtual",
      "Criar uma Identidade gerenciada atribuída pelo usuário para a máquina virtual",
      "Conceder acesso ao key vault via Políticas de acesso baseadas em funções (RBAC)",
      "Conceder acesso via o uso de segredos"
    ],
    "correct": [
      "Habilitar uma Identidade gerenciada atribuída pelo sistema para a máquina virtual",
      "Conceder acesso ao key vault via Políticas de acesso baseadas em funções (RBAC)"
    ],
    "body": "O que você deve implementar para cumprir esses requisitos? Selecione duas alternativas."
  },
  {
    "id": "103",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Qual dos recursos a seguir pode ser usado para recuperar informações de perfil de usuário do Microsoft Entra ID?",
    "options": [
      "Explorador de armazenamento do Azure",
      "API do Microsoft Graph",
      "Azure Monitor",
      "Azure Compliance Manager"
    ],
    "correct": [
      "API do Microsoft Graph"
    ]
  },
  {
    "id": "104",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está configurando acesso baseado em função (RBAC) para uma instância do Registro de Contêineres do Azure. A função deve permitir que alguém efetue pull e push das imagens em um registro de contêineres.",
    "options": [
      "Dono",
      "Contribuidor",
      "AcrPush",
      "AcrPull"
    ],
    "correct": [
      "AcrPush"
    ],
    "body": "Qual das funções a seguir deve ser usada, considerando que o princípio de privilégio mínimo deve ser aplicado?"
  },
  {
    "id": "105",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua empresa está desenvolvendo uma solução que fará uso dos Tópicos do Barramento de Serviço do Azure. Diferentes assinaturas devem ser criadas baseado em diferentes requisitos. A solução é uma aplicação de ecommerce que irá processar pedidos. Os pedidos serão enviados para um tópico. As mensagems enviadas terão as seguintes propriedades: ",
    "options": [
      "SQLFilter",
      "Correlation Filter",
      "Boolean Filter"
    ],
    "correct": [
      "Boolean Filter"
    ],
    "body": "Qual é o melhor filtro para criar uma assinatura que irá receber todos os pedidos?",
    "requirements": [
      "OrderId - Esse é o id único do pedido. Será usado para identificar a mensagem",
      "Quantity - A quantidade de itens no pedido. Será uma propriedade personalizada da mensagem",
      "Priority - Pode ter o valor 'alto', 'médio' ou 'baixo'. Será uma propriedade personalizada da mensagem"
    ]
  },
  {
    "id": "106",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua empresa está desenvolvendo uma solução que fará uso dos Tópicos do Barramento de Serviço do Azure. Diferentes assinaturas devem ser criadas baseado em diferentes requisitos. A solução é uma aplicação de ecommerce que irá processar pedidos. Os pedidos serão enviados para um tópico. As mensagems enviadas terão as seguintes propriedades: ",
    "options": [
      "SQLFilter",
      "Correlation Filter",
      "Boolean Filter"
    ],
    "correct": [
      "Correlation Filter"
    ],
    "body": "Qual é o melhor filtro para criar uma assinatura que irá receber apenas os pedidos com prioridade 'alta'?",
    "requirements": [
      "OrderId - Esse é o id único do pedido. Será usado para identificar a mensagem",
      "Quantity - A quantidade de itens no pedido. Será uma propriedade personalizada da mensagem",
      "Priority - Pode ter o valor 'alto', 'médio' ou 'baixo'. Será uma propriedade personalizada da mensagem"
    ]
  },
  {
    "id": "107",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua empresa está desenvolvendo uma solução que fará uso dos Tópicos do Barramento de Serviço do Azure. Diferentes assinaturas devem ser criadas baseado em diferentes requisitos. A solução é uma aplicação de ecommerce que irá processar pedidos. Os pedidos serão enviados para um tópico. As mensagems enviadas terão as seguintes propriedades: ",
    "options": [
      "SQLFilter",
      "Correlation Filter",
      "Boolean Filter"
    ],
    "correct": [
      "SQLFilter"
    ],
    "body": "Qual é o melhor filtro para criar uma assinatura que irá receber apenas os pedidos com uma quantidade mínima de 50 itens?",
    "requirements": [
      "OrderId - Esse é o id único do pedido. Será usado para identificar a mensagem",
      "Quantity - A quantidade de itens no pedido. Será uma propriedade personalizada da mensagem",
      "Priority - Pode ter o valor 'alto', 'médio' ou 'baixo'. Será uma propriedade personalizada da mensagem"
    ]
  },
  {
    "id": "108",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua companhia atualmente cuida de uma instância de Gerenciamento de API do Azure e uma instância de Aplicativo Web do Azure, que está hospedando um conjunto de APIs. As APIs foram configuradas para usar o Gerenciamento de API como um gateway.",
    "options": [
      "inbound",
      "backend",
      "outbound",
      "on-error"
    ],
    "correct": [
      "inbound"
    ],
    "body": "Você precisa escrever uma política de Gerenciamento de API para modificar o URL de requisição de entrada para um URL de requisição de saída. Em qual seção de política você deve escrever esse código?"
  },
  {
    "id": "109",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua companhia atualmente cuida de uma instância de Gerenciamento de API do Azure e uma instância de Aplicativo Web do Azure, que está hospedando um conjunto de APIs. As APIs foram configuradas para usar o Gerenciamento de API como um gateway.",
    "options": [
      "inbound",
      "backend",
      "outbound",
      "on-error"
    ],
    "correct": [
      "outbound"
    ],
    "body": "Você precisa escrever uma política de Gerenciamento de API para mudar o formato de resposta antes de enviar a resposta de volta ao cliente. Em qual seção de política você deve escrever esse código?"
  },
  {
    "id": "110",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua empresa está desenvolvendo uma solução. A solução deve fazer uso de um serviço do Azure que seja baseado em um modelo de Publicação-Assinatura. Qual serviço a seguir você deve sugerir?",
    "options": [
      "Barramento de serviço do Azure",
      "Armazenamento de Filas do Azure",
      "Hubs de eventos do Azure",
      "Funções do Azure"
    ],
    "correct": [
      "Barramento de serviço do Azure"
    ]
  },
  {
    "id": "111",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Abaixo está um trecho de código que está usando concorrência otimizada quando múltiplas escritas são feitas para um item de blob.",
    "options": [
      "Etag eTag = response.Value.Details.ETag;",
      "Eresponse eTag = response.Value.Etag",
      "ifMatch = eTag",
      "ifMatch-Else = eTag"
    ],
    "correct": [
      "Etag eTag = response.Value.Details.ETag;",
      "ifMatch = eTag"
    ],
    "body": "Como você deve completar o trecho?",
    "code": "question-111.md"
  },
  {
    "id": "112",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua equipe atualmente cuida de uma aplicação Web estática hospedada em um contêiner do Armazenamento do Azure. Eles precisam garantir que os headers possam ser configurados para a aplicação Web.",
    "options": [
      "Migrar a aplicação para um Aplicativo Web do Azure",
      "Configurar o nível de acesso do contêiner como 'Privado'",
      "Colocar o endpoint Web em um CDN do Azure",
      "Especificar um index.html como página inicial"
    ],
    "correct": [
      "Colocar o endpoint Web em um CDN do Azure",
      "Migrar a aplicação para um Aplicativo Web do Azure"
    ],
    "body": "Quais soluções você pode sugerir para atender a esse requisito?"
  },
  {
    "id": "113",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você precisa desenvolver um aplicação que irá permitir usuário autenticados no Microsoft Entra buscarem as informações de perfil Nome e Identidades. Qual solicitação abaixo você deve fazer?",
    "options": [
      "GET https://graph.microsoft.com/v1.0/users/{user-id}?$select=givenName,identities",
      "GET https://graph.microsoft.com/v1.0/users/{user-id}?$select=displayName,identities",
      "GET https://graph.microsoft.com/v1.0/me",
      "GET https://graph.microsoft.com/v1.0/me?$select=displayName,identities",
      "POST https://graph.microsoft.com/v1.0/users/{user-id}?$select=givenName,identities"
    ],
    "correct": [
      "GET https://graph.microsoft.com/v1.0/users/{user-id}?$select=givenName,identities"
    ]
  },
  {
    "id": "114",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você precisa desenvolver um aplicação que irá permitir usuário autenticados no Microsoft Entra buscarem as informações de perfil Nome e Identidades. Qual o mínimo de permissão que deve ser passado para o Objeto de aplicativo associado à aplicação?",
    "options": [
      "Permissão de aplicativo - User.Read",
      "Permissão delegada - User.Read",
      "Permissão de aplicativo - User.ReadWrite",
      "Permissão delegada - User.ReadWrite"
    ],
    "correct": [
      "Permissão delegada - User.Read"
    ]
  },
  {
    "id": "115",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua equipe implantou uma aplicação no serviço de Aplicativo de Contêiner do Azure. Qual recurso pode ser usado para atender o requisito a seguir?",
    "options": [
      "Log streaming",
      "Console do contêiner",
      "Log Analytics do Azure Monitor",
      "Alertas do Azure Monitor"
    ],
    "correct": [
      "Log streaming"
    ],
    "requirements": [
      "Ver o fluxo do sistema e os logs do console de um contêiner em quase tempo real"
    ]
  },
  {
    "id": "116",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua equipe implantou uma aplicação no serviço de Aplicativo de Contêiner do Azure. Qual recurso pode ser usado para atender o requisito a seguir?",
    "options": [
      "Log streaming",
      "Console do contêiner",
      "Log Analytics do Azure Monitor",
      "Alertas do Azure Monitor"
    ],
    "correct": [
      "Console do contêiner"
    ],
    "requirements": [
      "Identificar bugs da aplicação de dentro do contêiner"
    ]
  },
  {
    "id": "117",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua equipe cuida de uma instância de Gerenciamento de API. Você precisa proteger uma API específica contra fluxos de requisições excessivas.",
    "options": [
      "Quotas",
      "Rate limits",
      "IP filters",
      "CORS"
    ],
    "correct": [
      "Rate limits"
    ],
    "body": "Qual configuração a seguir você deve definir em uma política de API?"
  },
  {
    "id": "118",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua equipe cuida de um namespace do Barramento de Serviço do Azure na camada de preço Básico. Eles precisam enviar mensagens existentes de filas do Barramento de Serviço para a Grade de Eventos do Azure usando uma assinatura da grade de eventos.",
    "options": [
      "Criar uma nova fila no Barramento de serviço",
      "Criar um novo tópico no Barramento de serviço",
      "Fazer upgrade do plano de preço do Barramento de serviço para o plano Standard",
      "Fazer upgrade do plano de preço do Barramento de serviço para o plano Premium"
    ],
    "correct": [
      "Fazer upgrade do plano de preço do Barramento de serviço para o plano Premium"
    ],
    "body": "O que deve ser feito para implementar esse requisito e garantir que os custos sejam mantidos no mínimo possível?"
  },
  {
    "id": "119",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua empresa planeja usar um serviço de Gerenciamento de API do Azure. Ele será utilizado em um conjunto de APIs. Você precisa mudar os valores passados em parâmetros de string-query usando uma política de set-query-parameter.",
    "options": [
      "inbound",
      "outbound",
      "backend",
      "on-error"
    ],
    "correct": [
      "inbound",
      "backend"
    ],
    "body": "Em quais seções você poderia aplicar essa política? Selecione duas opções corretas"
  },
  {
    "id": "120",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo uma aplicação Java serverless no Azure. Você cria uma nova instância do Azure Key Vault para trabalhar com segredos de um aplicativo de Funções do Azure. A aplicação deve atender aos seguintes requisitos: ",
    "options": [
      "1º: ",
      "2º: ",
      "3º: "
    ],
    "correct": [
      "Criar uma aplicativo de Funções do Azure na camada de preço Premium",
      "Configurar uma identidade gerenciada pelo sistema para o aplicativo",
      "Criar uma política de acesso no Azure Key Vault para a identidade da aplicação"
    ],
    "body": "Você precisa conceder ao aplicativo de Funções acesso ao key vault. Qual a ordem em que você deve performar as ações?",
    "requirements": [
      "Fazer referência ao Azure Key Vault sem precisar de mudanças no código Java",
      "Dinamicamente adicionar e remover instâncias do host das Funções do Azure baseado no número de eventos recebidos",
      "Garantir que as instâncias estão sempre alertas, para evitar inicios frios",
      "Conectar com uma VNet",
      "A autenticação com a instância do Azure Key Vault deve ser removida se o aplicativo de Funções for deletado"
    ]
  },
  {
    "id": "121",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você desenvolve um website. Você planeja hospedar o website no Azure e espera que ele experencie altos volumes de tráfego depois de publicado. Você deve garantir que o website permaneça disponível e ao mesmo tempo minimizar os custos.",
    "options": [
      "Implantar o website em uma máquina virtual. Configurar a máquina virtual para escalar automaticamente quando a carga de CPU estiver alta",
      "Implantar o website em um serviço de aplicativo que usa a camada de acesso Compartilhada. Configurar o serviço de aplicativo para escalar automaticamente quando a carga de CPU estiver alta",
      "Implantar o website em uma máquina virtual. Configurar um conjunto de disponibilidade para aumentar automaticamente quando a carga de CPU estiver alta",
      "Implantar o website em um serviço de aplicativo que usa a camada de acesso Standard. Configurar o serviço de aplicativo para escalar automaticamente quando a carga de CPU estiver alta"
    ],
    "correct": [
      "Implantar o website em um serviço de aplicativo que usa a camada de acesso Standard. Configurar o serviço de aplicativo para escalar automaticamente quando a carga de CPU estiver alta"
    ],
    "body": "O que você deve fazer?"
  },
  {
    "id": "122",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua equipe está desenvolvendo um aplicativo web em Java. O código do aplicativo está hospedado em um repositório do GitHub em https://github.com/Salgado2004/CLI-Playground. O aplicativo web deve ser avaliado antes de ser movido para produção. Você deve implantar a release inicial do código em um slot de implantação chamado 'staging'.",
    "options": [
      "(1)",
      "(2)",
      "(3)",
      "(4)",
      "(5)"
    ],
    "correct": [
      "group",
      "appservice plan",
      "webapp",
      "webapp deployment slot",
      "webapp deployment source"
    ],
    "body": "Você precisa criar um aplicativo web e implantar o código. Como você deve completar os comandos?",
    "code": "question-122.md"
  },
  {
    "id": "123",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você tem um serviço Web que é usado para pagar por entregas de comida e usa o Azure Cosmos DB para armazenar seus dados. Você planeja adicionar um novo recurso que permite os usuários informarem um valor de gorjeta. No novo recurso precisa que uma propriedade 'tip' esteja presente e contenha um valor numérico.",
    "options": [
      "getContext.getRequest()",
      "if(!(\"tip\" in i))",
      "getContext.getResponse()",
      "if(isNaN(i)[\"tip\"] || i[\"tip\"] === null)",
      "r.setBody(i)",
      "if (request.getValue(\"tip\") === null)",
      "r.setValue(i)"
    ],
    "correct": [
      "getContext.getRequest()",
      "if (isNaN(i)[\"tip\"] || i[\"tip\"] === null)",
      "r.setBody(i)"
    ],
    "body": "Como você deve completar o trigger do Cosmos DB?",
    "code": "question-123.md"
  },
  {
    "id": "124",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você desenvolve um aplicativo do Azure Function disparado por HTTP para processar dados de um blob do Armazenamento do Azure. O aplicativo é acionado usando uma ligação de saída no blob. O tempo limite do aplicativo ocorre após quatro minutos. O aplicativo deve processar os dados do blob. Você precisa garantir que o aplicativo não atinja o tempo limite e processe os dados do blob.",
    "options": [
      "Configurar o aplicativo para usar um plano de hospedagem do Serviço de Aplicativo e habilitar a propriedade Always On",
      "Passar a carga do gatilho HTTP para uma fila do Barramento de Serviço do Azure para ser processada por uma função de gatilho de fila e retorne uma resposta HTTP bem-sucedida imediata.",
      "Atualizar a propriedade functionTimeout do arquivo host.json do projeto para 10 minutos",
      "Usar o padrão assíncrono de Funções Duráveis para processar os dados do blob"
    ],
    "correct": [
      "false",
      "true",
      "false",
      "true"
    ],
    "body": "Marque 'verdadeiro' se as soluções apresentadas atendem o objetivo, caso contrário, marque 'falso'"
  },
  {
    "id": "125",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está desenvolvendo uma aplicação que usa o Armazenamento de Blobs do Azure. A aplicação precisa ler os logs transacionais de todas as mudanças que ocorrerem nos blobs e os metadados de blob na conta de armazenamento por razões de auditoria. As mudanças devem estar na ordem em que ocorreram, incluindo apenas as operações 'create', 'update', 'delete', e 'copy', e devem ser guardadas por motivos de conformidade.",
    "options": [
      "Processar todos os eventos do Armazenamento de Blobs do Azure usando a Grade de Eventos do Azure com um aplicativo de Funções assinante",
      "Habilitar o Feed de Alterações da conta de armazenamento e processar todas as mudanças para os eventos disponíveis",
      "Processar todos os logs analíticos do Armazenamento do Azure por eventos de blob bem sucedidos",
      "Usar a API HTTP Data Collector do Azure Monitor e escanear o corpo das requisições por eventor de blob bem sucedidos"
    ],
    "correct": [
      "Habilitar o Feed de Alterações da conta de armazenamento e processar todas as mudanças para os eventos disponíveis"
    ],
    "body": "Você precisa processar os logs transacionais de maneira assíncrona. O que você deve fazer?"
  },
  {
    "id": "126",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você planeja criar uma imagem Docker que roda uma aplicação ASP.NET Core chamada MeBooksApp. Você configurou um script chamado setupScript.ps1 e uma série de arquivos de aplicação, incluindo MeBooksApp.dll. Você precisa criar um dockerfile que atenda aos seguintes requisitos: ",
    "options": [
      "1º: ",
      "2º: ",
      "3º: ",
      "4º: ",
      "5º: "
    ],
    "correct": [
      "CMD [\"dotnet\", \"MeBooksApp.dll\"]",
      "FROM microsoft/aspnetcore:latest",
      "WORKDIR /apps/MeBooksApp",
      "COPY ./ .",
      "RUN powershell ./setupScript.ps1"
    ],
    "body": "O dockerfile deve ser criado na mesma pasta em que setupScript.ps1 e MeBooksApp.dll estão armazenados. Em que ordem você deve executar os comandos?",
    "requirements": [
      "Chamar o setupScript.ps1 no momento de build do contêiner",
      "Executar MeBooksApp.dll quando o contêiner iniciar"
    ]
  },
  {
    "id": "127",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo de Funções do Azure que processa imagens que são enviadas para um contêiner de Blob do Azure. As imagens devem ser processadas o mais rápido possível assim que são enviadas, e a solução deve minimizar a latência. Você cria um código para processar as imagens que o aplicativo de Função é disparado.",
    "options": [
      "Usar o plano do Serviço de Aplicativo. Configurar o aplicativo de Função para usar o input trigger do armazenamento de Blobs do Azure.",
      "Usar o plano de Consumo. Configurar o aplicativo de Função para usar um trigger do armazenamento de Blobs do Azure.",
      "Usar o plano de Consumo. Configurar o aplicativo de Função para usar um trigger de tempo.",
      "Usar o plano do Serviço de Aplicativo. Configurar o aplicativo de Função para usar um trigger do armazenamento de Blobs do Azure.",
      "Usar o plano de Consumo. Configurar o aplicativo de Função para usar o input trigger do armazenamento de Blobs do Azure."
    ],
    "correct": [
      "Usar o plano do Serviço de Aplicativo. Configurar o aplicativo de Função para usar um trigger do armazenamento de Blobs do Azure."
    ],
    "body": "Você deve configurar o aplicativo de Função. O que você deve fazer?"
  },
  {
    "id": "128",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está se preparando para implantar um website no serviço de Aplicativo Web do Azure a partir de um repositório do GitHub. O website inclui conteúdo estático gerado por um script. Você planeja usar o recurso de Implantação contínua do Aplicativo Web do Azure.",
    "options": [
      "Adicionar o caminho para a ferramenta de geração de conteúdo estático na configuração WEBSITE_RUN_FROM_PACKAGE no arquivo host.json",
      "Adicionar um alvo PreBuild no arquivo csproj do projeto que executa o script de geração de conteúdo",
      "Criar um arquivo chamado run.cmd na pasta /run que chama o script que gera o conteúdo estático e implanta o website",
      "Criar um arquivo chamado .deployment na raiz do repositório que chama o script que gera o conteúdo estático"
    ],
    "correct": [
      "Adicionar um alvo PreBuild no arquivo csproj do projeto que executa o script de geração de conteúdo",
      "Criar um arquivo chamado .deployment na raiz do repositório que chama o script que gera o conteúdo estático"
    ],
    "body": "Você precisa executar o script de geração do conteúdo antes do website começar a receber tráfego. Quais são as duas maneiras possíveis de atingir esse objetivo?"
  },
  {
    "id": "129",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está desenvolvendo uma aplicação para usar o Armazenamento de Blobs do Azure. Você configurou o serviço para incluir um Feed de Alterações. Uma cópia da sua conta de armazenamento precisa ser criada em outra região. Os dados devem ser copiados do armazenamento atual para a nova conta de armazenamento diretamente através de servidores de armazenamento.",
    "options": [
      "1º: ",
      "2º: ",
      "3º: ",
      "4º: ",
      "5º: "
    ],
    "correct": [
      "Criar um novo template de implantação",
      "Exportar o template do Resource Manager (ARM)",
      "Modificar o template mudando o nome da conta de armazenamento e a região",
      "Implantar o template para criar uma nova conta de armazenamento na região escolhida",
      "Usar o AZCopy para copiar os dados para a nova conta de armazenamento"
    ],
    "body": "Você precisa criar a cópia da conta de armazenamento e copiar os dados. Em que ordem você deve executar os passos a seguir?"
  },
  {
    "id": "130",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está se preparando para implantar uma aplicação baseada em Máquina Virtual do Azure. As VMs que executam a aplicação possuem os seguintes requisitos: ",
    "options": [
      "Configuração do Firewall",
      "Script de serviços de apoio"
    ],
    "correct": [
      "Run command",
      "Hybrid Runbook Worker"
    ],
    "body": "Você precisa garantir que os requisitos sejam cumpridos. Quais recursos você deve usar?",
    "requirements": [
      "Quando uma VM é provisionada, o firewall deve ser automaticamente configurado antes que a máquina possa acessar recursos do Azure",
      "Serviços de apoio devem ser instalados usando um script do PowerShell guardado no Armazenamento do Azure"
    ]
  },
  {
    "id": "131",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Uma empresa está desenvolvendo um aplicativo Web em Angular. O aplicativo Web está hospedado em um repositório do GitHub localizado em https://github.com/Salgado2004/Angular-Ecommerce-UFPR-Faz-Sistema. O aplicativo Web deve ser revisado antes de ser movido para produção. Você deve implantar a release inicial do código em um slot de implantação chamado 'review'.",
    "options": [
      "(1)",
      "(2)",
      "(3)",
      "(4)"
    ],
    "correct": [
      "New-AzResourceGroup",
      "New-AzAppServicePlan",
      "New-AzWebApp",
      "New-AzWebAppSlot"
    ],
    "body": "Você deve criar o aplicativo Web e implantar o código. Como você deve completar os comandos?",
    "code": "question-131.md"
  },
  {
    "id": "132",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você cria o script PowerShell a seguir",
    "options": [
      "Um alerta de log é criado para enviar um email quando a porcentagem da CPU for mais que 60% durante 5 minutos",
      "Um alerta de log é criado para enviar um email quando o números de 'heartbeats' da máquina virtual for menor do que 5 na última hora",
      "Um alerta de log é agendado para rodar a cada duas horas"
    ],
    "correct": [
      "false",
      "true",
      "false"
    ],
    "body": "Para cada afirmativa, marque 'verdadeiro' ou 'falso'. Cada seleção correta vale um ponto.",
    "code": "question-132.md"
  },
  {
    "id": "133",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo de Funções do Azure. O aplicativo possui os seguintes requisitos: ",
    "options": [
      "Permitir aos desenvolvedores escrever funções usando a linguagem Rust",
      "Declarativamente conectar com uma conta de Armazenamento de Blobs do Azure"
    ],
    "correct": [
      "Custom handler",
      "Trigger"
    ],
    "body": "Quais recursos das Funções do Azure você deve usar para cumprir cada requisito?",
    "requirements": [
      "Permitir aos desenvolvedores escrever funções usando a linguagem Rust",
      "Declarativamente conectar com uma conta de Armazenamento de Blobs do Azure"
    ]
  },
  {
    "id": "134",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo Web em ASP.NET Core. Você planeja implantar o aplicativo em um Aplicativo Web do Azure para Contêineres. O aplicativo deve armazenar dados de diagnóstico de execução, que devem persistir durante reinicializações. Você tem o seguinte código: ",
    "options": [
      "LOCALAPPDATA",
      "WEBSITE_LOCALCACHE_ENABLED",
      "DOTNET_HOSTING_OPTIMIZATION_CACHE",
      "WEBSITES_ENABLE_APP_SERVICE_STORAGE"
    ],
    "correct": [
      "WEBSITES_ENABLE_APP_SERVICE_STORAGE"
    ],
    "body": "Você precisa configurar a aplicação para que os dados de diagnóstico sejam armazenados corretamente. Qual configuração você deve usar?",
    "code": "question-134.md"
  },
  {
    "id": "135",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo Web protegido pelo Azure Web Application Firewall (WAF). Todo o tráfego para o aplicativo Web é roteado por meio de uma instância de Gateway de Aplicativo do Azure usada por vários aplicativos Web. O endereço do aplicativo Web é myapplicationgateway.azurewebsites.net. Todo o tráfego deve ser protegido com SSL.",
    "options": [
      "Nas configurações de HTTP do Gateway de Aplicativo, habilitar a configuração de serviço 'Use for App'",
      "Converter o aplicativo Web para rodar em um Ambiente do Serviço de Aplicativo do Azure (ASE)",
      "Adicionar certificados de autenticação para myapplicationgateway.azurewebsites.net no Gateway de Aplicativo",
      "Nas configurações de HTTP do Gateway de Aplicativo, configure o valor da opção 'Override backend path' como myapplicationgateway22.azurewebsites.net"
    ],
    "correct": [
      "Nas configurações de HTTP do Gateway de Aplicativo, habilitar a configuração de serviço 'Use for App'",
      "Adicionar certificados de autenticação para myapplicationgateway.azurewebsites.net no Gateway de Aplicativo"
    ],
    "body": "Você precisa configurar o Gateway de Aplicativo para os aplicativos Web. Quais duas ações você deve executar?"
  },
  {
    "id": "136",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo uma aplicação Web que roda em um Aplicativo Web do Azure. A aplicação armazena dados em um banco de dados SQL do Azure e arquivos em uma conta de armazenamento. A aplicação Web faz requisições HTTP para serviços externos como parte das operações normais. A aplicação Web está instrumentada com o Application Insights.",
    "options": [
      "Adicionar o ID de cliente do usuário conectado ao CorrelationContext no aplicativo da web",
      "No SpanContext atual, definir o TraceId como o ID de cliente do usuário conectado",
      "Definir o cabeçalho Ocp-Apim-Trace para o ID de cliente do usuário conectado",
      "Criar um novo SpanContext com o valor TraceFlags definido como o ID de cliente para o usuário conectado"
    ],
    "correct": [
      "Adicionar o ID de cliente do usuário conectado ao CorrelationContext no aplicativo da web"
    ],
    "body": "Você precisa garantir que o ID do cliente autenticado seja associado com todas as operações ao longo do sistema. O que você deve fazer?"
  },
  {
    "id": "137",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você provisiona Máquinas virtuais (VMs) como ambientes de desenvolvimento. Uma VM não inicia. A VM está travada em um processo de atualização do Windows. Você anexa o disco do SO da VM afetada em uma VM de recuperação.",
    "options": [
      "1º: ",
      "2º: ",
      "3º: ",
      "4º: "
    ],
    "correct": [
      "Executar o comando: `dism /image:\\ /get=packages > c:\\temp\\Patch.txt`",
      "Abrir o arquivo C:\\temp\\Patch.txt e localizar a atualização que está em estado pendente",
      "Executar o comando: `dism /Image:<Discos de SO anexados>:\\ /Remove Package /PackageName:<nome do pacote para deletar>`",
      "Desanexe o disco do So e recrie a VM"
    ],
    "body": "Você precisa corrigir o problema. Em qual ordem você deve executar os seguintes passos?"
  },
  {
    "id": "138",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo de Funções do Azure. Você desenvolve um código usando uma linguagem que não é suportada na hospedagem do aplicativo de Funções do Azure. A linguagem suporta HTTP primitives. Você precisa implantar o código no ambiente de produção das Funções do Azure.",
    "options": [
      "Publicação de código em uma pilha de Runtime Powershell",
      "Publicação de contêiner em uma pilha de Runtime Powershell",
      "Publicação de código em uma pilha de Runtime Personalizada",
      "Publicação de contêiner em uma pilha de Runtime Personalizada"
    ],
    "correct": [
      "Publicação de código em uma pilha de Runtime Personalizada"
    ],
    "body": "Você precisa configurar o aplicativo para a implantação. Qual configuração você deve usar?"
  },
  {
    "id": "139",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo baseado em Funções Duráveis do Azure que processa uma lista de valores de entrada. A aplicação é monitorada através de uma aplicação que recupera dados JSON de um endpoint de diagnóstico da Função Azure. Durante o processamento, uma única instância de entrada inválida não causa falha na função. A entrada inválida deve estar disponível para o aplicativo de monitoramento.",
    "options": [
      "await context.CallEntityAsync(input[errIndex],\"error\")",
      "context.SignalEntity(input[errIndex],\"error\")",
      "Failed",
      "Completed",
      "input",
      "output",
      "runtimeStatus"
    ],
    "correct": [
      "await context.CallEntityAsync(input[errIndex],\"error\")",
      "Failed",
      "input"
    ],
    "body": "Você deve implementar o aplicativo de Funções Duráveis e a aplicação de monitoramento. Como você deve completar os segmentos de código?",
    "code": "question-139.md"
  },
  {
    "id": "140",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo uma Função Durável do Azure para processar pedidos online. O processamento deve chamar uma API externa para buscar informações de desconto do produto.",
    "options": [
      "Orquestrador",
      "Entidade",
      "Atividade",
      "Cliente"
    ],
    "correct": [
      "Orquestrador",
      "Atividade"
    ],
    "body": "Você precisa implementar a função. Quais tipos de funções duráveis você deve usar?"
  },
  {
    "id": "141",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está escrevendo uma série de templates aninhados do Azure Resource Manager (ARM) para implantar múltiplos recursos do Azure. Os templates devem ser testados antes da implantação e devem seguir práticas recomandadas.",
    "options": [
      "Determinar se os templates seguem as práticas recomendadas",
      "Testar e validar mudanças que os templates podem causar nos ambientes"
    ],
    "correct": [
      "Azure Resource Manager test toolkit",
      "Operação What-if"
    ],
    "body": "Você precisa validar e testar os templates antes da implantação. Quais ferramentas do ARM você deve usar?"
  },
  {
    "id": "142",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo uma Função Durável do Azure para gerenciar empréstimos de veículos. O processo de empréstimo inclui ações que devem ser executadas em uma ordem específica. Uma das ações inclui um processo de verificação de crédito do cliente, que pode levar alguns dias para ser completa.",
    "options": [
      "Orquestrador",
      "Entidade",
      "Atividade",
      "Cliente"
    ],
    "correct": [
      "Orquestrador"
    ],
    "body": "Você precisa implementar a função. Qual tipo de função durável você deve usar?"
  },
  {
    "id": "143",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um aplicativo de Funções do Azure. Todas as funções no aplicativo devem cumprir os seguintes requisitos: ",
    "options": [
      "exponentialBackoff",
      "counterThreshold",
      "fixedDelay",
      "maxRetryCount",
      "healthCheckInterval"
    ],
    "correct": [
      "exponentialBackoff",
      "maxRetryCount"
    ],
    "body": "Você precisa configurar o arquivo host.json. Como você deve completar o segmento de código?",
    "requirements": [
      "Executar até que ocorra uma execução bem sucedida ou um máximo de 10 tentativas",
      "Garantir que exista um intervalo de no mínimo 20 segundos e no máximo 15 minutos entre as tentativas"
    ],
    "code": "question-143.md"
  },
  {
    "id": "144",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você desenvolveu uma solução do Aplicativo Web do Azure para uma companhia de mergulho comercial. Regulamentos exigem que todos os mergulhadores preencham um formulário de saúde 15 dias depois de cada trabalho de mergulho. Você precisa configurar o aplicativo Web para que o número de instâncias aumente quando os mergulhadores estiverem preenchendo o formulário, e diminua quando eles terminarem. Você precisa configurar o autoescalonamento.",
    "options": [
      "Perfil de recorrência",
      "Autoescalonamento baseado em uso de CPU",
      "Perfil de data fixa",
      "Autoescalonamento preditivo"
    ],
    "correct": [
      "Perfil de recorrência",
      "Autoescalonamento baseado em uso de CPU"
    ],
    "body": "Quais são as duas configurações possíveis de autoescalonamento para alcançar esse objetivo?"
  },
  {
    "id": "145",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo um jogo online que permite que os jogadores votem na imagem que ilustra uma palavra favorita. O jogo é construído usando as Funções do Azure e usa entidades duráveis para rastrear a conta de votos. A janela de votos é de 30 segundos. Você deve minimizar a latência.",
    "options": [
      "CallEntityAsync",
      "SignalEntityAsync",
      "[DurableClient] IDurableEntityClient",
      "[DurableClient] IDurableOrchestrationClient"
    ],
    "correct": [
      "SignalEntityAsync",
      "[DurableClient] IDurableEntityClient"
    ],
    "body": "Como você deve completar o código? Selecione as opções corretas.",
    "code": "question-145.md"
  },
  {
    "id": "146",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você tem um plano do Serviço de Aplicativo chamado asp1, atualmente usando a camada de preço gratuita. Você planeja usar o asp1 para implementar um aplicativo de Funções do Azure que um gatilho de filas. Sua solução deve minimizar o custo.",
    "options": [
      "Fazer upgrade do plano de preço para Básico e habilitar a configuração Always On",
      "Fazer upgrade do plano de preço para Standard e habilitar a configuração Always On",
      "Fazer upgrade do plano de preço para Básico e configurar implantação contínua",
      "Fazer upgrade do plano de preço para Standard e configurar implantação contínua"
    ],
    "correct": [
      "Fazer upgrade do plano de preço para Básico e habilitar a configuração Always On"
    ],
    "body": " Você precisa identificar a opção de configuração que atende aos requisitos. Qual configuração você deve usar?"
  },
  {
    "id": "147",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo vários microsserviços para executarem em um aplicativo de Contêiner do Azure. Os microsserviços devem permitir acesso HTTPS usando um domínio personalizado.",
    "options": [
      "1º: ",
      "2º: ",
      "3º: ",
      "4º: ",
      "5º: "
    ],
    "correct": [
      "Habilitar a opção \"Entrada HTTP\"",
      "Adicionar o nome de domínio personalizado",
      "Associar o certificado SSL",
      "Adicionar o registro CNAME no DNS",
      "Validar o nome de domínio"
    ],
    "body": "Você deve configurar o domínio personalizado. Em que ordem você deve performar as ações?"
  },
  {
    "id": "148",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo vários microsserviços para executarem em um aplicativo de Contêiner do Azure. Entrada HTTP externa foi habilitada para os microsserviços. Eles devem ser implantados na mesma rede virtual e devem escrever logs na mesma workspace do Log Analytics.",
    "options": [
      "Habilitar o modo de revisão única",
      "Usar um ambiente separado para cada contêiner",
      "Usar uma imagem de um registro de contêiner privado única para todos os contêineres",
      "Usar um único ambiente para todos os contêineres",
      "Habilitar o modo de revisão múltipla"
    ],
    "correct": [
      "Usar um único ambiente para todos os contêineres"
    ],
    "body": "O que você deve fazer?"
  },
  {
    "id": "149",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo vários microsserviços para executarem em um aplicativo de Contêiner do Azure. Entrada HTTP externa foi habilitada para os microsserviços. Um microsserviço implantado deve ser atualizado para permitir que os usuários testem novos recursos. Você tem os seguintes requisitos: ",
    "options": [
      "URL única para usuários de teste",
      "Ativação do microsserviço atual"
    ],
    "correct": [
      "Rótulo de revisão",
      "Modo de revisão"
    ],
    "body": "Você precisa configurar o aplicativo de contêiner. Quais recursos você deve configurar?",
    "requirements": [
      "Habilitar e manter uma única URL para o microsserviço atualizado que será disponibilizada para usuários de teste",
      "Atualizar o microsserviço que corresponde à versão atual do microsserviço implantado"
    ]
  },
  {
    "id": "150",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você planeja desenvolver um aplicativo de Funções do Azure com um gatilho HTTP. O aplicativo deve cumprir os seguintes requisitos: ",
    "options": [
      "Premium",
      "10 minutos",
      "Consumo",
      "230 segundos",
      "Dedicado",
      "Ilimitado"
    ],
    "correct": [
      "Premium",
      "230 segundos"
    ],
    "body": "Você deve identificar o plano de preço do aplicativo e o máximo de tempo que uma função pode levar para responder antes de um timeout.",
    "requirements": [
      "Autoescalonamento baseado em eventos",
      "Habilidade de usar imagens Linux personalizadas para executar as funções"
    ]
  },
  {
    "id": "151",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você desenvolveu uma aplicação em Python para renderizar imagens. A aplicação usa recursos de GPU para otimizar o processo de renderização. Você tem os seguintes requisitos: ",
    "options": [
      "Instâncias de Contêiner do Azure",
      "Aplicativos de Contêiner do Azure",
      "Serviço de Kubernetes do Azure (AKS)",
      "Serviço de Aplicativo do Azure"
    ],
    "correct": [
      "Instâncias de Contêiner do Azure"
    ],
    "body": "Você precisa implantar a aplicação no Azure. Qual serviço você deve usar?",
    "requirements": [
      "A aplicação deve ser implantada em um contêiner Linux",
      "O contêiner deve ser parado quando a execução terminar",
      "A solução deve minimizar os custos"
    ]
  },
  {
    "id": "152",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você desenvolveu uma aplicação em Python para renderizar imagens. A aplicação usa recursos de GPU para otimizar o processo de renderização. Você tem os seguintes requisitos: ",
    "options": [
      "Política de reinício",
      "Variáveis de ambiente",
      "Identidade gerenciada atribuída pelo sistema",
      "Identidade gerenciada atribuída pelo usuário"
    ],
    "correct": [
      "Política de reinício"
    ],
    "body": "Qual configuração você deve fazer para atender ao segundo requisito?",
    "requirements": [
      "A aplicação deve ser implantada em um contêiner Linux",
      "O contêiner deve ser parado quando a execução terminar",
      "A solução deve minimizar os custos"
    ]
  },
  {
    "id": "153",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você planeja desenvolver um aplicativo de Funções do Azure com um gatilho do Armazenamento de Blobs do Azure. O aplicativo não será usado frequentemente, com uma duração limitada de execuções individuais. O aplicativo deve cumprir os seguintes requisitos: ",
    "options": [
      "Premium",
      "10 minutos",
      "Consumo",
      "230 segundos",
      "Dedicado",
      "Ilimitado"
    ],
    "correct": [
      "Consumo",
      "10 minutos"
    ],
    "body": "Você deve identificar o plano de preço do aplicativo e o máximo de tempo que uma função pode levar para responder antes de um timeout.",
    "requirements": [
      "Autoescalonamento baseado em eventos",
      "Suporte para slots de implantação",
      "A solução deve minimizar os custos"
    ]
  },
  {
    "id": "154",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo ASP.NET Core hospedado no Serviço de Aplicativo do Azure. O aplicativo exige que as declarações personalizadas sejam retornadas do Microsoft Entra ID para autorização do usuário. As reivindicações devem ser removidas quando o registro do aplicativo for removido.",
    "options": [
      "Exija o escopo https://graph.microsoft.com/.default durante a autenticação.",
      "Configure o aplicativo para usar o fluxo de código de autorização OAuth 2.0.",
      "Implementar middleware personalizado para recuperar informações de função do Azure AD.",
      "Adicione os grupos ao atributo groupMembershipClaims no manifesto do aplicativo.",
      "Adicione as funções ao atributo appRoles no manifesto do aplicativo."
    ],
    "correct": [
      "Adicione as funções ao atributo appRoles no manifesto do aplicativo."
    ],
    "body": "Você precisa incluir as declarações personalizadas no token de acesso do usuário. O que você deveria fazer?"
  },
  {
    "id": "155",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo vários microsserviços para executarem em um aplicativo de Contêiner do Azure. Entrada HTTP externa foi habilitada para os microsserviços. Sua companhia exige que atualizações dos microsserviços não causem indisponibilidade do sistema.",
    "options": [
      "Habilitar o modo de revisão única",
      "Usar um ambiente separado para cada contêiner",
      "Usar uma imagem de um registro de contêiner privado única para todos os contêineres",
      "Usar um único ambiente para todos os contêineres",
      "Habilitar o modo de revisão múltipla"
    ],
    "correct": [
      "Habilitar o modo de revisão única"
    ],
    "body": "Você precisa implantar uma atualizaçõa. O que você deve fazer?"
  },
  {
    "id": "156",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Uma empresa usa Aplicativos de Contêiner do Azure. Um aplicativo contêiner denominado App1 reside em um grupo de recursos denominado RG1. A empresa exige testes de atualizações do App1. Você habilita vários modos de revisão no App1.",
    "options": [
      "container app",
      "container connection",
      "containerapp connection",
      "containerapp ingress",
      "containerapp revision"
    ],
    "correct": [
      "containerapp ingress"
    ],
    "body": "Você precisa configurar como o tráfego é roteado para cada revisão do App1. Como você deve completar o comando do Azure CLI acima?",
    "code": "question-156.md"
  },
  {
    "id": "157",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você implanta um Aplicativo de Contêiner do Azure e desabilita a entrada HTTP no aplicativo de contêiner. Os usuários relatam que não conseguem acessar o aplicativo. Você investiga e observa que o aplicativo foi dimensionado para 0 instâncias. Você precisa resolver o problema com o aplicativo contêiner.",
    "options": [
      "Habilitar a entrada HTTP, criar uma regra de escalonamento HTTP e aplicar a regra ao aplicativo de contêiner",
      "Habilitar a entrada HTTP, criar uma regra de escalonamento personalizado e aplicar a regra ao aplicativo de contêiner",
      "Habilitar a entrada HTTP e configurar o número mínimo de réplicas com valor 1"
    ],
    "correct": [
      "false",
      "false",
      "true"
    ],
    "body": "Marque 'verdadeiro' se as soluções apresentadas atendem o objetivo, caso contrário, marque 'falso'"
  },
  {
    "id": "158",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está desenvolvendo uma solução que usa a biblioteca de cliente do Azure Storage para .NET. Você tem o seguinte código: ",
    "options": [
      "O código cria uma concessão (lease) infinita",
      "O código na linha 5 sempre cria um novo blob",
      "O block finally libera a concessão (lease) do blob"
    ],
    "correct": [
      "true",
      "false",
      "true"
    ],
    "body": "Para cada alternativa, marque 'verdadeiro' ou 'falso'. Cada seleção correta vale um ponto.",
    "code": "question-158.md"
  },
  {
    "id": "159",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está construindo um website que usa o Armazenamento de Blobs do Azure para armazenar seus dados. Você configura o ciclo de vida do armazenamento de blobs para mover todos os blobs para a camada de arquivos depois de 30 dias. Cliente exigiram um SLA (Service Level Agreement) para visualizar dados com mais de 30 dias.",
    "options": [
      "Pelo menos dois dias",
      "Entre 1 e 15 horas",
      "Pelo menos um dia",
      "Entre 0 e 60 minutos"
    ],
    "correct": [
      "Entre 1 e 15 horas"
    ],
    "body": "Você precisa documentar o SLA para recuperação de dados. O que você deve incluir na documentação?"
  },
  {
    "id": "160",
    "exam": "AZ204",
    "type": "select",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está desenvolvendo um sistema de compra de passagens de uma companhia aérea. A solução de armazenamento da solução deve atender aos seguintes requisitos: ",
    "options": [
      "Sessão",
      "Eventual",
      "Forte",
      "Desatualização limitada",
      "Prefixo consistente"
    ],
    "correct": [
      "Desatualização limitada"
    ],
    "body": "Você precisa provisionar uma conta do Cosmos DB com a API SQL. Qual tipo de consistência você deve usar?",
    "requirements": [
      "Garantir pelo menos 99,99% de disponibilidade e ter baixa latência",
      "Aceitar reservas mesmo que haja uma falha de rede ou outras falhas imprevistas",
      "Processar requisições na ordem exata em que foram enviadas para minimizar a possibilidade de overbooking",
      "Permitir reservas simultâneas ou fora de ordem com uma janela de tolerância de no máximo 5 segundos"
    ],
    "code": "question-160.md"
  },
  {
    "id": "161",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está desenvolvendo um sistema de compra de passagens de uma companhia aérea. A solução de armazenamento da solução deve atender aos seguintes requisitos: ",
    "options": [
      "--enable-virtual-network true",
      "--enable-automatic-failover true",
      "--kind 'GlobalDocumentDB'",
      "--kind 'MongoDB'"
    ],
    "correct": [
      "--enable-automatic-failover true"
    ],
    "body": "Você precisa provisionar uma conta do Cosmos DB com a API SQL. Qual parâmetro você deve configurar para preencher o espaço (2)?",
    "requirements": [
      "Garantir pelo menos 99,99% de disponibilidade e ter baixa latência",
      "Aceitar reservas mesmo que haja uma falha de rede ou outras falhas imprevistas",
      "Processar requisições na ordem exata em que foram enviadas para minimizar a possibilidade de overbooking",
      "Permitir reservas simultâneas ou fora de ordem com uma janela de tolerância de no máximo 5 segundos"
    ],
    "code": "question-160.md"
  },
  {
    "id": "162",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está se preparando para implantar um website em python em um Aplicativo Web do Azure usando um contêiner. A solução vai usar múltiplos contêineres no mesmo grupo de contêineres. A instância de Registro de Contêiner do Azure chamado 'images' é um registro privado. O nome de usuário e senha é 'admin. O dockerfile que builda o contêiner está a seguir: '",
    "options": [
      "--sku Shared",
      "--tags container",
      "--sku B1 --hyper-v",
      "--sku B1 --is-linux"
    ],
    "correct": [
      "--sku B1 --is-linux"
    ],
    "body": "Você builda o contêiner usando o comando 'docker build -t images.azurecr.io/website:v1.0.0'. O website deve sempre executar a mesma versão, independente de builds futuras. Como você deve completar o espaço (1) do comando acima?",
    "requirements": [
      "FROM python:3 ADD website.py CMD [\"python\", \"website.py\"]"
    ],
    "code": "question-162.md"
  },
  {
    "id": "163",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está se preparando para implantar um website em python em um Aplicativo Web do Azure usando um contêiner. A solução vai usar múltiplos contêineres no mesmo grupo de contêineres. A instância de Registro de Contêiner do Azure chamado 'images' é um registro privado. O nome de usuário e senha é 'admin. O dockerfile que builda o contêiner está a seguir: '",
    "options": [
      "--deployment-container-image-name images.azurecr.io/website:v1.0.0",
      "--deployment-container-image-name images.azurecr.io/website:latest",
      "--deployment-source-url images.azurecr.io/website:v1.0.0",
      "--deployment-source-url images.azurecr.io/website:latest"
    ],
    "correct": [
      "--deployment-container-image-name images.azurecr.io/website:v1.0.0"
    ],
    "body": "Você builda o contêiner usando o comando 'docker build -t images.azurecr.io/website:v1.0.0'. O website deve sempre executar a mesma versão, independente de builds futuras. Como você deve completar o espaço (2) do comando acima?",
    "requirements": [
      "FROM python:3 ADD website.py CMD [\"python\", \"website.py\"]"
    ],
    "code": "question-162.md"
  },
  {
    "id": "164",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está se preparando para implantar um website em python em um Aplicativo Web do Azure usando um contêiner. A solução vai usar múltiplos contêineres no mesmo grupo de contêineres. A instância de Registro de Contêiner do Azure chamado 'images' é um registro privado. O nome de usuário e senha é 'admin. O dockerfile que builda o contêiner está a seguir: '",
    "options": [
      "set --python-version 2.7 --generic-configurations user=admin password=admin",
      "set --python-version 3.6 --generic-configurations user=admin password=admin",
      "container set --docker-registry-server-url https://images.azurecr.io -u admin -p admin",
      "container set --docker-registry-server-url https://images.azurecr.io/website -u admin -p admin"
    ],
    "correct": [
      "container set --docker-registry-server-url https://images.azurecr.io -u admin -p admin"
    ],
    "body": "Você builda o contêiner usando o comando 'docker build -t images.azurecr.io/website:v1.0.0'. O website deve sempre executar a mesma versão, independente de builds futuras. Como você deve completar o espaço (3) do comando acima?",
    "requirements": [
      "FROM python:3 ADD website.py CMD [\"python\", \"website.py\"]"
    ],
    "code": "question-162.md"
  },
  {
    "id": "165",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você tem uma aplicação que usa o Armazenamento de Blobs do Azure e precisa atualizar os metadados dos blobs. Quais três métodos você pode usar para atualizar os metadados dos blobs?",
    "options": [
      "Metadata.Add",
      "SetMetadataAsync",
      "FetchAttributesAsync",
      "UploadFileStream",
      "SetPropertiesAsync"
    ],
    "correct": [
      "Metadata.Add",
      "SetMetadataAsync",
      "FetchAttributesAsync"
    ]
  },
  {
    "id": "166",
    "exam": "AZ204",
    "type": "truefalse",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você está desenvolvendo uma solução do Azure para coletar dados de dispositivos de ponto de venda (POS) de 2.000 lojas localizadas em todo o mundo. Um único dispositivo pode produzir 2 megabytes (MB) de dados a cada 24 horas. Cada local de armazenamento possui de um a cinco dispositivos que enviam dados. Você deve armazenar os dados do dispositivo no armazenamento de Blobs do Azure. Os dados do dispositivo devem ser correlacionados com base em um identificador de dispositivo. Espera-se que lojas adicionais sejam abertas no futuro. Você precisa implementar uma solução para receber os dados do dispositivo.",
    "options": [
      "Provisionar uma Grade de Eventos do Azure. Configure o identificador da máquina como chave de partição e habilite a captura.",
      "Provisionar um Hub de Eventos do Azure. Configure o identificador da máquina como chave de partição e habilite a captura."
    ],
    "correct": [
      "false",
      "true"
    ],
    "body": "Marque 'verdadeiro' se as soluções apresentadas atendem o objetivo, caso contrário, marque 'falso'"
  },
  {
    "id": "167",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está mantendo uma aplicação que usa o Armazenamento de Blobs do Azure na camada de preço GPv1. A aplicação tem os seguintes requisitos: ",
    "options": [
      "1º: ",
      "2º: ",
      "3º: "
    ],
    "correct": [
      "Atualizar a camada de preço para GPv2",
      "Criar um novo serviço de Armazenamento de Blobs na camada de preço GPv2 e configurar a camada de acesso padrão como 'Cool'",
      "Mover os blobs para o novo serviço de Armazenamento de Blobs"
    ],
    "body": "Você precisa configurar a conta para usar Gerenciamento de ciclo de vida que movem os blobs para a camada de arquivos depois de 1 anos. Em que ordem você deve executar as ações?",
    "requirements": [
      "Dados mais velhos que 3 meses são raramente usados",
      "Dados mais novos que 3 meses devem estar disponíveis imediatamente",
      "Dados mais velhos que 1 ano precisam ser armazenados, mas não precisam estar disponíveis imediatamente"
    ]
  },
  {
    "id": "168",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você desenvolve soluções no Azure. Uma aplicação .NET precisa receber uma mensagem toda vez que uma Máquina virtual do Azure termina de processar seus dados. As mensagens NÃO devem persistir depois de processadas pela aplicação.",
    "options": [
      "QueueClient",
      "CloudQueueClient",
      "TopicClient",
      "SubscriptionClient"
    ],
    "correct": [
      "QueueClient"
    ],
    "body": "Você precisa implementar o objeto .NET que irá receber as mensagens. Qual objeto você deve usar?"
  },
  {
    "id": "169",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você desenvolve soluções no Azure. Você precisa conectar com um banco de dados NoSQL globalmente distribuído usando uma API do .NET. Você precisa criar o objeto para configurar e executar as requisições para o banco de dados. Quais segmento de código você deve escolher?",
    "options": [
      "new Container(EndpointUri, PrimaryKey)",
      "new Database(EndpointUri, PrimaryKey)",
      "new CosmosClient(EndpointUri, PrimaryKey)"
    ],
    "correct": [
      "new CosmosClient(EndpointUri, PrimaryKey)"
    ]
  },
  {
    "id": "170",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você tem uma conta de armazenamento do Azure que guarda grandes volumes de dados, espalhados em diversos contêineres. Você precisa copiar todos os dados da conta de armazenamento atual para uma nova conta. O processo de cópia deve seguir os seguintes critérios: ",
    "options": [
      "AzCopy",
      "Explorador de armazenamento do Azure",
      "Portal do Azure",
      "Biblioteca de cliente de armazenamento do .NET"
    ],
    "correct": [
      "AzCopy"
    ],
    "body": "O que você deve usar?",
    "requirements": [
      "Automatizar o movimento dos dados",
      "Minimizar a interação de usuário necessária para performar a operação",
      "Garantir que o processo de cópia seja reversível"
    ]
  },
  {
    "id": "171",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está desenvolvendo uma nova página para um website que usa o Azure Cosmos DB para armazenar dados. Você precisa mostrar os dados na nova página em uma ordem específica. Você cria a seguinte consulta: ",
    "options": [
      "orderBy",
      "sortOrder",
      "ascending",
      "descending",
      "compositeIndexes"
    ],
    "correct": [
      "descending",
      "compositeIndexes"
    ],
    "body": "Você precisa configurar uma política do Cosmos DB para suportar a consulta. Como você deve completar a política?",
    "requirements": [
      "SELECT * FROM people p ORDER BY p.name, p.city DESC"
    ],
    "code": "question-171.md"
  },
  {
    "id": "172",
    "exam": "AZ204",
    "type": "select",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você está construindo um sistema de monitoramento de tráfego que monitora 6 rodovias. O sistema produz relatórios baseados em análises de séries temporais para cada rodovia. Os dados dos sensores de tráfego são armazenados no Hub de Eventos do Azure e consumidos por 4 departamentos. Cada departamento tem um Aplicativo Web do Azure que mostra os relatórios e contém um WebJob que processa os dados vindos do Hub de Eventos. Todos os aplicativos web executam em planos de Serviço de Aplicativo com 3 instâncias. O throughput dos dados deve ser maximizado e a latência deve ser minimizada.",
    "options": [
      "3 partições e chave de partição por rodovia",
      "6 partições e chave de partição por departamento",
      "6 partições e chave de partição por rodovia",
      "3 partições e chave de partição por departamento"
    ],
    "correct": [
      "6 partições e chave de partição por rodovia"
    ],
    "body": "Você precisa configurar o hub de eventos. Quais configurações você deve usar?"
  },
  {
    "id": "173",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você está desenvolvendo uma solução de microsserviços. Você planeja implantar a solução em um cluster multi-nós do Serviço de Kubernetes do Azure (AKS). Você deve implantar a solução para atender os seguintes requisitos: ",
    "options": [
      "Implantar a solução",
      "Visualizar o cluster e endereço de IP externo",
      "Implementar um único endereço IP público que é roteado para múltiplos microsserviços"
    ],
    "correct": [
      "Helm",
      "KubeCtl",
      "Ingress controller"
    ],
    "body": "Quais componentes você deve usar? Arraste os componentes para a área correta.",
    "requirements": [
      "Habilidade de proxy reverso",
      "Roteamento de tráfego configurável",
      "Terminação TLS com certificado personalizado"
    ]
  },
  {
    "id": "174",
    "exam": "AZ204",
    "type": "dragdrop",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você está implementando um sistema de processamento de pedidos. A aplicação de ponto de vendas publica pedidos em tópicos do Barramento de Serviço do Azure. O sistema tem os seguintes requisitos para as assinaturas: ",
    "options": [
      "Assinatura 1",
      "Assinatura 2",
      "Assinatura 3",
      "Assinatura 4",
      "Assinatura 5"
    ],
    "correct": [
      "Boolean Filter",
      "Correlation Filter",
      "SQLFilter",
      "SQLFilter",
      "Nenhum filtro"
    ],
    "body": "Você precisa implementar filtros e maximizar o throughput. Quais filtros você deve usar para cada assinatura?",
    "requirements": [
      "Assinatura 1: Reservada para uso futuro e não deve receber pedidos",
      "Assinatura 2: Recebe todos os pedidos de prioridade alta e internacionais",
      "Assinatura 3: Recebe todos os pedidos em que o país/região não é o Brasil",
      "Assinatura 4: Recebe todos os pedidos com quantidade de itens maior que 100 unidades",
      "Assinatura 5: É usada para fins de auditoria. A assinatura recebe todos os pedidos e tem uma ação definida para atualizar a propriedade AuditedAt."
    ],
    "code": "question-174.md"
  },
  {
    "id": "175",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Sua empresa possui uma assinatura do Azure. Você precisa implantar várias máquinas virtuais do Azure em um único conjunto de disponibilidade usando modelos do Azure Resource Manager (ARM). Você precisa garantir que o modelo ARM permita o maior número possível de VMs permeneça acessível em caso de falha ou manutenção da estrutura.",
    "options": [
      "10",
      "30",
      "Valor mínimo",
      "Valor máximo"
    ],
    "correct": [
      "Valor máximo"
    ],
    "body": "Qual das opções a seguir é o valor que você deve configurar para a propriedade platformFaultDomainCount?"
  },
  {
    "id": "176",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo Web para um e-Commerce e deseja usar o Key Vault do Azure para garantir que as entradas no aplicativo sejam protegidas usando a autenticação do Serviço de Aplicativo do Azure e o Microsoft Entra ID.",
    "options": [
      "Executar o comando 'az keyvault secret'",
      "Habilitar o Azure AD Connect",
      "Habilitar o Managed Service Identity (MSI)",
      "Criar uma entidade de serviço do Azure AD"
    ],
    "correct": [
      "Habilitar o Managed Service Identity (MSI)"
    ],
    "body": "O que você deve fazer no aplicativo Web de e-Commerce?"
  },
  {
    "id": "177",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você gerencia um banco de dados SQL do Azure que permite a autenticação do Microsoft Entra. Você precisa garantir que os desenvolvedores de banco de dados possam se conectar ao banco de dados SQL por meio do Microsoft SQL Server Management Studio (SSMS). Também precisa garantir que os desenvolvedores usem sua conta local do Active Directory para autenticação.",
    "options": [
      "Token do Azure AD",
      "Autenticação multifator do Azure",
      "Autenticação integrada do Active Directory",
      "Tokens de software OATH"
    ],
    "correct": [
      "Autenticação integrada do Active Directory"
    ],
    "body": "Sua estratégia deve permitir que os prompts de autenticação sejam reduzidos ao mínimo. Qual das opções a seguir você deve implementar?"
  },
  {
    "id": "178",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo para transferir dados entre servidores de arquivos locais e o armazenamento de Blobs do Azure. O aplicativo armazena chaves, segredos e certificados no Azure Key Vault e utiliza suas APIs. Você pretende configurar a aplicação para permitir a recuperação de uma eliminação acidental do cofre de chaves ou dos objetos do cofre de chaves durante 90 dias após a eliminação.",
    "options": [
      "Executar o cmdlet Add-AzKeyVaultKey",
      "Executar o comando CLI 'az keyvault update --enable-soft-delete true --enable-purge-protection true'",
      "Implementar endpoints de serviço de rede virtual para o Azure Key Vault",
      "Executar o comando CLI 'az keyvault update --enable-soft-delete false'"
    ],
    "correct": [
      "Executar o comando CLI 'az keyvault update --enable-soft-delete true --enable-purge-protection true'"
    ],
    "body": "O que você deve fazer?"
  },
  {
    "id": "179",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você tem uma nova assinatura do Azure e está desenvolvendo um site interno para que os funcionários visualizem dados confidenciais. O site usa o Microsoft Entra para autenticação.",
    "options": [
      "Configurar o site para usar o Microsoft Entra B2C",
      "No Microsoft Entra, criar uma nova política de acesso condicional",
      "Atualizar para o plano premium do Microsoft Entra",
      "No Microsoft Entra, habilitar o proxy de aplicativo",
      "No acesso condicional do Microsoft Entra, habilitar a política de linha de base"
    ],
    "correct": [
      "No Microsoft Entra, criar uma nova política de acesso condicional",
      "Atualizar para o plano premium do Microsoft Entra"
    ],
    "body": "Você precisa implementar a autenticação multifator para o site. Quais são as duas ações que você deve realizar?"
  },
  {
    "id": "180",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você gerencia um aplicativo de processamento de dados que recebe solicitações de um serviço do armazenamento de Filas do Azure. Você precisa gerenciar o acesso à fila e tem os seguintes requisitos: ",
    "options": [
      "Serviço SAS com uma política de acesso armazenada",
      "Conta SAS",
      "SAS de delegação de usuário",
      "Serviço SAS com SAS ad hoc"
    ],
    "correct": [
      "Serviço SAS com uma política de acesso armazenada"
    ],
    "body": "Qual tipo de assinatura de acesso compartilhado (SAS) você deve usar?",
    "requirements": [
      "Fornecer a outros aplicativos acesso à fila do Azure",
      "Certificar-se de que pode revogar o acesso À fila sem ter que gerar novas chaves da conta de armazenamento",
      "Especificar o acesso ao nível da fila e não ao nível da conta de armazenamento"
    ]
  },
  {
    "id": "181",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está criando um aplicativo Web que usa a plataforma de identidade da Microsoft para autenticação de usuário. Você está implementado a identificação do usuário para o aplicativo Web.",
    "options": [
      "Aud",
      "Nonce",
      "OID (Object ID)",
      "IDP (ID Provider)"
    ],
    "correct": [
      "OID (Object ID)"
    ],
    "body": "Você precisa recuperar uma declaração para identificar exclusivamente um usuário. Qual tipo de declaração você deve usar?"
  },
  {
    "id": "182",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo Web que usa a plataforma de identidade da Microsoft para autenticar usuários e recursos. O aplicativo chama várias APIs REST. As APIs requerem um token de acesso da plataforma de identidade da Microsoft.",
    "options": [
      "URI/URL de redirecionamento",
      "ID do aplicativo",
      "Nome do aplicativo",
      "Senha do aplicativo",
      "Tipo de conta compatível"
    ],
    "correct": [
      "URI/URL de redirecionamento",
      "ID do aplicativo",
      "Senha do aplicativo"
    ],
    "body": "Você precisa solicitar um token. Quais são as 3 propriedades que você deve usar?"
  },
  {
    "id": "183",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você desenvolve e implanta um aplicativo Web no Serviço de Aplicativo do Azure. O aplicativo acessa dados em uma conta de Armazenamento do Azure. A conta contém vários contêineres com vários blobs com grandes quantidades de dados. Você implantou todos os recursos do Azure em uma única região.",
    "options": [
      "Iniciar um failover de conta de armazenamento",
      "Exportar o modelo do Azure Resource Manager (ARM) da conta de armazenamento",
      "Configurar a replicação de objetos para todos os blobs",
      "Usar a ferramenta de CLI AzCopy",
      "Criar uma nova conta de armazenamento na região atual"
    ],
    "correct": [
      "Exportar o modelo do Azure Resource Manager (ARM) da conta de armazenamento"
    ],
    "body": "Você precisa mover a conta de Armazenamento do Azure para uma nova região. Você deve copiar todos os dados para a nova região. O que você deve fazer primeiro?"
  },
  {
    "id": "184",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Sua organização implanta o Azure Cosmos DB. Você precisa garantir que o índice seja atualizado à medida que os itens são criados, atualizados ou excluídos.",
    "options": [
      "Configurar o modo de indexação como Lazy",
      "Configurar o valor da propriedade automática da política de indexação como False",
      "Configurar a opção EnableScanInQuery como True",
      "Configurar o modo de indexação como Consistente"
    ],
    "correct": [
      "Configurar o modo de indexação como Consistente"
    ],
    "body": "O que você deve fazer?"
  },
  {
    "id": "185",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você está atualizando um aplicativo que armazena dados no Azure Cosmos DB. O aplicativo usa vários documentos associados a um único nome de usuário e requer a capacidade de atualizar esses vários documentos em uma única operação ACID.",
    "options": [
      "Criar uma coleção fragmentada por nome de usuário para armazenar documentos",
      "Configurar o Azure Cosmos DB para usar a API do Gremlin",
      "Criar uma coleção não fragmentada para armazenar documentos",
      "Configurar o Azure Cosmos DB para usar a API do MongoDB"
    ],
    "correct": [
      "Criar uma coleção não fragmentada para armazenar documentos",
      "Configurar o Azure Cosmos DB para usar a API do MongoDB"
    ],
    "body": "Você precisa configurar o Cosmos DB. Quais são as duas ações que você deve realizar?"
  },
  {
    "id": "186",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você tem um aplicativo de console baseado em contêiner Linux que carrega arquivos de imagem de sites de clientes em todo o mundo. Um sistema back-end executado em máquinas virtuais do Azure processa as imagens usando a API de Blobs do Azure. Você não tem permissão para fazer alterações no aplicativo. Alguns sites de clientes possuem apenas conexões de internet por telefone.",
    "options": [
      "Azure BlobFuse",
      "Armazenamento de discos do Azure",
      "Suporte ao Sistema de Rede de Arquivos (NFS) 3.0 do Armazenamento do Azure",
      "Armazenamento de arquivos do Azure"
    ],
    "correct": [
      "Azure BlobFuse"
    ],
    "body": "Você precisa configurar o aplicativo para acessar as imagens. O que você deve usar?"
  },
  {
    "id": "187",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo Java que usa o Apache Cassandra para armazenar dados de chave e valor. Você planeja usar um novo recurso do Azure Cosmos DB e a API Cassandra no aplicativo. Você cria um grupo do Microsoft Entra chamado Cosmos Db Creators para permitir o provisionamento de contas, bancos de dados e contêineres do Azure Cosmos DB. O grupo não deve conseguir as chaves necessárias para acesso aos dados",
    "options": [
      "Contribuidor da conta DocumentDB",
      "Operador de Backup do Cosmos",
      "Operador do Cosmos DB",
      "Leitor da conta do Cosmos DB"
    ],
    "correct": [
      "Operador do Cosmos DB"
    ],
    "body": "Você precisa restringir o acesso ao grupo do Microsoft Entra. QUal controle de acesso baseado em função (RBAC) você deve usar?"
  },
  {
    "id": "188",
    "exam": "AZ204",
    "type": "options",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Sua empresa está desenvolvendo uma API do Azure. Você precisa implementar a autenticação da API para acessar outros recursos no Azure. Você tem os seguintes requisitos: ",
    "options": [
      "Básico",
      "Anônimo",
      "Identidade gerenciada",
      "Certificado do cliente"
    ],
    "correct": [
      "Identidade gerenciada"
    ],
    "body": "Qual mecanismo de autenticação você deve usar?",
    "requirements": [
      "Todas as chamadas de API devem ser autenticadas",
      "Os chamadores da API não devem enviar credenciais à API"
    ]
  },
  {
    "id": "189",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver para armazenamento do Azure",
    "header": "Você desenvolveu um aplicativo que permite aos usuários fazer upload de fotos e vídeos para o armazenamento do Azure. O aplicativo usa uma chamada de API REST de armazenamento para carregar a mídia em uma conta de armazenamento de blob chamada Account1, onde você tem dois contêineres chamados container1 e container2. O envio de vídeos ocorre de forma irregular.",
    "options": [
      "Copiar blobs para o container2 usando a operação Put Blob da API REST do Serviço de Blob",
      "Criar um tópico da Grade de Eventos que use o cmdlet 'Start-AzureStorageBlobCopy'",
      "Usar o AzCopy com a opção Snapshot para copiar blobs para o container2",
      "Baixar o blob para uma máquina virtual e, em seguida, fazer upload do blob para o container2"
    ],
    "correct": [
      "Criar um tópico da Grade de Eventos que use o cmdlet 'Start-AzureStorageBlobCopy'"
    ],
    "body": "Você preciaa copiar blobs específicos do container1 para o container2 quando um novo vídeo é carregado. O que você deve fazer?"
  },
  {
    "id": "190",
    "exam": "AZ204",
    "type": "options",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você está desenvolvendo um site ASP.NET Core que usa o Azure FrontDoor. O site é usado para construir conjuntos de dados meteorológicos personalizados para pesquisadores. Os conjuntos de dados são baixados como arquivos CSV. Os dados são atualizados a cada 10 horas. Arquivos específicos devem ser eliminados do cache do FrontDoor com base nos valores do Cabeçalho de Resposta.",
    "options": [
      "Eliminação de caminho único",
      "Eliminação de curinga",
      "Eliminação de domínio raiz"
    ],
    "correct": [],
    "body": "Você precisa limpar ativos individuas do cache do FrontDoor. Que tipo de limpeza de cache você deve usar?"
  },
  {
    "id": "191",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você é desenvolvedor de uma empresa de SaaS que oferece muitos serviços da web. Todos os serviços da empresa devem atender aos seguintes requisitos: ",
    "options": [
      "Jsonp",
      "Certificado de autenticação",
      "Cabeçalho de verificação",
      "Validate-jwt"
    ],
    "correct": [
      "Validate-jwt"
    ],
    "body": "Qual política de gerenciamento de API você deve implementar?",
    "requirements": [
      "Usar o Gerenciamento de API para acessar os serviços",
      "Usar OpenID Connect para autenticação",
      "Impedir o uso anônimo"
    ]
  },
  {
    "id": "192",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você desenvolve uma API REST e implementa um SAS de delegação de usuário para se comunicar com o armazenamento de Blobs do Azure. O token está comprometido e você precisa revogá-lo.",
    "options": [
      "Revogar a chave de delegação",
      "Excluir a política de acesso armazenada",
      "Gerar novamente a chave da conta",
      "Remover a atribuição de função do princípio de segurança"
    ],
    "correct": [
      "Revogar a chave de delegação",
      "Remover a atribuição de função do princípio de segurança"
    ],
    "body": "Quais são as duas maneiras possíveis de atingir esse objetivo?"
  },
  {
    "id": "193",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você desenvolve e implanta um aplicativo Lógico do Azure que chama um aplicativo de Funções do Azure. O aplicativo de funções inclui uma definição OpenAPI (Swagger) e usa uma conta de armazenamento de Blobs do Azure. Todos os recursos são protegidos usando o Microsoft Entra. O aplicativo lógico deve acessar com segurança a conta de armazenamento de Blobs. Os recursos do Microsoft Entra devem permanecer se o aplicativo for excluído.",
    "options": [
      "Criar uma função personalizada do Microsoft Entra e atribuir a função à conta de armazenamento de Blobs",
      "Criar um Azure Key Vault e emitir um certificado de cliente",
      "Criar uma identidade gerenciada atribuída pelo usuário e atribuir controles de acesso baseado em funções (RBAC)",
      "Criar uma identidade gerenciada atribuída pelo sistema e emitir um certificado de cliente",
      "Criar uma função personalizada do Microsoft Entra e atribuir controles de acesso baseado em funções (RBAC)"
    ],
    "correct": [
      "Criar uma identidade gerenciada atribuída pelo usuário e atribuir controles de acesso baseado em funções (RBAC)"
    ],
    "body": "Você precisa proteger o aplicativo. O que você deve fazer?"
  },
  {
    "id": "194",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você implanta um aplicativo Web do Serviço de Aplicativo do Azure. Você cria um registro de aplicativo no Microsoft Entra e no X (Twitter). O aplicativo deve autenticar usuários e usar SSL para todas as comunicações. O aplicativo deve usar o X como provedor de identidade.",
    "options": [
      "Cabeçalho do token de ID",
      "Assinatura do token de identificação",
      "Código de resposta HTTP",
      "ID do locatário"
    ],
    "correct": [
      "Assinatura do token de identificação"
    ],
    "body": "Você precisa validar a solicitação do Microsoft Entra no código do aplicativo. O que você deve validar?"
  },
  {
    "id": "195",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo uma Função do Azure que chama APIs externas fornecendo um token de acesso para a API. O token de acesso é armazenado em um segredo no Azure Key Vault denominado mykeyvault.",
    "options": [
      "KeyVault:mykeyvault;Secret:token",
      "App:Settings:Secret:mykeyvault:token",
      "AZUREKVCONNSTR_https://mykeyvault.vault.azure.net/secrets/token/",
      "@Microsoft.KeyVault(SecretUri=https://mykeyvault.vault.azure.net/secrets/token/"
    ],
    "correct": [
      "@Microsoft.KeyVault(SecretUri=https://mykeyvault.vault.azure.net/secrets/token/"
    ],
    "body": "Você precisa garantir que a aplicação possa acessar o token. Qual valor você deve armazenar na configuração do aplicativo de Funções do Azure?"
  },
  {
    "id": "196",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Uma empresa mantém vários aplicativos da web e móveis. Cada aplicativo usa provedores de identidade internos personalizados, bem como provedores de identidade social. Você precisa implementar o logon único (SSO) para todos os aplicativos.",
    "options": [
      "Usar o Azure Active Directory B2C (Azure AD B2C) com políticas personalizadas",
      "Usar o Azure Active Directory B2B (Azure AD B2B) e permitir colaboração externa",
      "Usar o Azure Active Directory B2C (Azure AD B2C) com fluxos de usuário",
      "Usar o Azure Active Directory B2B (Azure AD B2B)."
    ],
    "correct": [
      "Usar o Azure Active Directory B2B (Azure AD B2B) e permitir colaboração externa"
    ],
    "body": "O que você deve fazer?"
  },
  {
    "id": "197",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Implementar a segurança do Azure",
    "header": "Você desenvolve um aplicativo Python para renderização de imagens que usa recursos de GPU para otimizar processos de renderização. Você implanta o aplicativo em um contêiner Linux das Instâncias de Contêiner do Azure (ACI). O aplicativo exige que um valor secreto seja passado quando o contêiner for iniciado. O valor só deve ser acessado de dentro do contêiner.",
    "options": [
      "Criar uma variável de ambiente e configurar a propriedade secureValue",
      "Adicionar o valor secreto à imagem do contêiner. Usar uma identidade gerenciada",
      "Adicionar o valor secreto ao código do aplicativo. Definir o comando de inicialização do contêiner",
      "Adicionar o valor secreto a uma conta de armazenamento de Blobs do Azure. Gerar um token SAS",
      "Montar um volume secreto contendo o valor secreto em um arquivo secreto"
    ],
    "correct": [
      "Criar uma variável de ambiente e configurar a propriedade secureValue",
      "Montar um volume secreto contendo o valor secreto em um arquivo secreto"
    ],
    "body": "Você precisa passar o valor secreto. Quais são as duas maneiras possíveis de atingir esse objetivo?"
  },
  {
    "id": "198",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo Web que usa a plataforma de identidade da Microsoft para autenticação de usuários e recursos. O aplicativo Web chama várias APIs REST. Uma chamada da API REST deve ler o calendário do usuário. O aplicativo Web requer permissão para enviar um email como usuário.",
    "options": [
      "Locatário",
      "Code_challenge",
      "Estado",
      "ID de cliente",
      "Escopo"
    ],
    "correct": [
      "Escopo"
    ],
    "body": "Você precisa autorizar o aplicativo web e a API. Qual parâmetro você deve usar?"
  },
  {
    "id": "199",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo Java para ser implantado no Azure. O aplicativo armazena dados confidenciais no Azure Cosmos DB. Você precisa configurar o Always Encrypted para criptografar os dados confidenciais dentro do aplicativo.",
    "options": [
      "Criar um novo contêiner para incluir uma política de criptografia com as propriedades JSON a serem criptografadas",
      "Criar uma chave gerenciada pelo cliente (CMK) e armazenar em uma nvoa instância do Azure Key Vault",
      "Criar uma chave de criptografia de dados (DEK) usando o SDK do Azure Cosmos DB e armazenar achave no Azure Cosmos DB",
      "Criar uma identidade gerenciada do Azure AS e atribuir a identidade a uma nova instância do Azure Key Vault"
    ],
    "correct": [
      "Criar uma chave gerenciada pelo cliente (CMK) e armazenar em uma nvoa instância do Azure Key Vault"
    ],
    "body": "O que você deve fazer primeiro?"
  },
  {
    "id": "200",
    "exam": "AZ204",
    "type": "options",
    "domain": "Implementar a segurança do Azure",
    "header": "Você está desenvolvendo um aplicativo que usa chaves armazenadas no Azure Key Vault. Você precisa impor um algoritmo criptográfico específico e um tamanho de chave para chaves armazenadas no cofre. O que você deve usar?",
    "options": [
      "Controle de versão secreto",
      "Política do Azure",
      "Firewall do Key Vault",
      "Políticas de acesso"
    ],
    "correct": [
      "Política do Azure"
    ]
  },
  {
    "id": "201",
    "exam": "AZ204",
    "type": "options",
    "domain": "Desenvolver soluções de computação do Azure",
    "header": "Você planeja implantar várias máquinas virtuais do Azure que executarão o Windows Server 2019 em um conjunto de escala de máquina virtual usando um modelo do Azure Resource Manager.",
    "options": [
      "O cmdlet Publish-AzVMSscConfiguration",
      "Insights de aplicativos do Azure",
      "Extensão de script personalizado do Azure",
      "Um perfil de configuração de dispositivo do Microsoft Endpoint Manager"
    ],
    "correct": [
      "Extensão de script personalizado do Azure"
    ],
    "body": "Você precisa garantir que o NGINX esteja disponível em todas as máquinas virtual após sua implantação. O que você deve usar?"
  },
  {
    "id": "202",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Conectar e consumir serviços do Azure e serviços de terceiros",
    "header": "Você está criando um sistema de notificação de perigo que possui um único servidor de sinalização que aciona alertas sonoros e visuais para iniciar e parar. Você implementa o Barramento de serviço do Azure para publicar alertas. Cada controlador de alerta utiliza o Barramento de serviço para receber sinais de alerta como parte de uma transação. Os eventos de alerta devem ser registrados para fins de auditoria. Cada registro de transação deve incluir informações sobre o tipo de alerta que foi ativado.",
    "options": [
      "Atribuir o valor da propriedade SessionID da mensagem de perigo à propriedade ReplyToSessionId",
      "Atribuir o valor da propriedade MessageID da mensagem de perido à proriedade DeliveryCount",
      "Atribuir o valor da propriedade SessionID da mensagem de perigo à propriedade SequenceNumber",
      "Atribuir o valor da propriedade MessageID da mensagem de perigo à propriedade CorrelationId",
      "Atribuir o valor da propriedade SequenceNumber da mensagem de perigo à propriedade DeliveryCount"
    ],
    "correct": [
      "Atribuir o valor da propriedade SessionID da mensagem de perigo à propriedade ReplyToSessionId",
      "Atribuir o valor da propriedade MessageID da mensagem de perigo à propriedade CorrelationId"
    ],
    "body": "Você precisa implementar uma solução de auditoria de trilha de resposta. Quais são as duas ações que você deve realizar?"
  },
  {
    "id": "203",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você desenvolve e implanta um aplicativo Web ASP.NET no Serviço de Aplicativo do Azure. Você usa a telemetria do Application Insights para monitorar o aplicativo. Você deve testar o aplicativo para garantir que ele esteja disponível e responsivo em vários pontos do mundo e em intervalos regulares. Se o aplicativo não estiver respondendo, você deverá emitir um alerta à equipe de suporte.",
    "options": [
      "Integração",
      "Multi-step",
      "Ping de URL",
      "Unidade",
      "Carga"
    ],
    "correct": [
      "Multi-step",
      "Ping de URL"
    ],
    "body": "Você precisa configurar testes para o aplicativo web. Quais são os dois tipos de teste que você pode usar?"
  },
  {
    "id": "204",
    "exam": "AZ204",
    "type": "multiple",
    "domain": "Monitorar, solucionar problemas e otimizar soluções do Azure",
    "header": "Você está desenvolvendo um serviço Web ASP.NET Core Web API. O serviço utiliza o Azure Application Insights para todo o acompanhamento de telemetria e dependência. O serviço lê e grava dados em um banco de dados diferente do Microsoft SQL Server.",
    "options": [
      "Telemetry.Context.Cloud.RoleInstance",
      "Telemetry.Id",
      "Telemetry.Name",
      "Telemetry.Context.Operation.Id",
      "Telemetry.Context.Session.Id"
    ],
    "correct": [
      "Telemetry.Id",
      "Telemetry.Context.Operation.Id"
    ],
    "body": "Você precisa garantir que o rastreamento de dependência funcione para chamadas ao banco de dados de terceiros. Quais são as duas propriedades de telemetria de dependência que você deve usar?"
  }
]